["RT @RedNationRising: The New York Senate just passed a law giving illegal aliens free college\n\nThey voted to deny Gold Star kids free colle…", "RT @JamesOKeefeIII: BREAKING @Project_Veritas: Insider Blows Whistle &amp; Exec Reveals Google Plan to Prevent \"Trump situation\" in 2020 on Hid…", "RT @AnthemRespect: @charliekirk11 August 2016, Peter Strzok Says We’ll Stop Trump From Becoming President.\n\nMr. President @realDonaldTrump,…", "RT @DineshDSouza: I’m trying to keep the @IlhanMN story straight. She marrried her brother to evade immigration laws? Then she divorced him…", "RT @IngrahamAngle: 92% of left-wing activists live with their parents, Berlin study finds https://t.co/tffnz64y5I via @MailOnline", "RT @RobertJohnDavi: I wish there was a way of flushing all the Democrats in political office in California down the toilet -where they belo…", "RT @RepMattGaetz: Gaetz: “Do any witnesses here have personal knowledge regarding the truth or falsity of a single material fact in the Mue…", "RT @MelissaTweets: So David Hogg, who is a moron, will be going to Harvard.\n\nKyle Kashuv, who graduated top of his class, will not be going…", "RT @w_terrence: .@realDonaldTrump is officially running in 2020!\n \nRT if you are singing &amp; dancing with me!!!\n\n#TrumpRallyOrlando https://t…", "RT @Breaking911: RAW VIDEO: Flight attendant, beverage cart smash into ceiling during violent turbulence!  https://t.co/QSAIB8LpTS", "RT @ksorbs: A party that supports abortion over Life, illegals aliens over its citizens, and refugees over its veterans is going to lecture…", "RT @RedNationRising: Obama:\n2% GDP growth is the “new normal”\n\nPresident Trump:\nUS economy grows at 3.2%\n\nObama:\nSome jobs “are just not go…", "RT @RedNationRising: This story disappeared quick - can't mar the 0bama \"legacy\" now can we? \n\nObama Accepted At Least $21.6 Million In For…", "RT @Liz_Wheeler: In the past weeks, Gov. @GregAbbott_TX has:\n\n- Banned red light cameras\n- OK'd beer delivery\n- Protected free speech on co…", "RT @WhiteHouse: Happy Birthday, President @realDonaldTrump! https://t.co/rFfcqxcBJ9", "RT @AZFreePatriot: This American Flag represents ALL AMERICANS-Its inclusive of ALL, regardless... Men &amp; Women of our military have served…", "RT @USMC: Today, 71 years ago, President Harry S. Truman signed the Women's Armed Services Integration Act into law and made women a perman…", "RT @JackPosobiec: How does he do it https://t.co/3lAwDPRm1j", "RT @realDonaldTrump: To the men who sit behind me, and to the boys who rest in the field before me: your example will never grow old. Your…", "RT @realDonaldTrump: #DDay75thAnniversary https://t.co/GIsoLML4NP", "RT @realDonaldTrump: As we approach the 75th Anniversary of D-Day, we proudly commemorate those heroic and honorable patriots who gave thei…", "I’m in Normandy France this week for the 75th anniversary of D-Day.  It’s very humbling.  We must never forget what these warriors did for us. 🇺🇸 God bless them! https://t.co/STmnvQokGg", "RT @charliekirk11: Gorsuch, Kavanaugh, 100 circuit court judges, thousands of regulations repealed, US energy independent, ISIS destroyed,…", "RT @TheGrilfriend: https://t.co/W4S2aqAjkq", "RT @RedNationRising: \"What the hell is this, folks? They exonerate Hillary because they think she didn’t intend to do what she did. They ca…", "RT @RedNationRising: MEXICO IS PAYING FOR THE WALL! https://t.co/wxrI8hHBj0", "RT @johncardillo: Mueller is a coward. \n\nKen Starr plainly stated the laws Bill Clinton broke. \n\nMueller had no case and is too pompous to…", "RT @DanCrenshawTX: Enjoy your Memorial Day and let us remember why we celebrate. We celebrate the lives of the heroes we have lost. Never F…", "RT @charliekirk11: Did you know:\n\nIn the entire 20th Century, 27 injunctions to stop a national policy were issued by District Court Judges…", "@tedlieu @Katherine_Omitt @realDonaldTrump @RubenGallego Obama and Clinton never served either so what’s your point?", "RT @marklevinshow: Trump’s the most abused president in history https://t.co/QhNZeMBx5t", "RT @Education4Libs: I find it funny how liberals will laugh &amp; mock Ben Carson for a simple miscommunication yet praise Ocasio-Cortez as if…", "RT @charliekirk11: 2015: Adam Schiff called for \"severe repercussions\" and \"force\" against Iran\n\n2019: He sides with Iran and blames Presid…", "RT @dbongino: If there was ever an indicator of the absolute moral bankruptcy of the Left it’s the sick, filthy, disgusting responses to th…", "RT @Education4Libs: Last Friday, a mob of 8-10 Somalians in Minneapolis injured several people with HAMMERS.\n\nBut nobody hears of these thi…", "RT @AZFreePatriot: Raise taxes, kill babies, open the borders, take guns away, tear down monuments, burn the flag, put grown men in girls s…", "RT @GovRonDeSantis: President @realDonaldTrump and I spoke yesterday and confirmed that he did not approve, nor would approve, sending immi…", "RT @1776Stonewall: What the fuck???? Gotta say though, Arnold still looks pretty big for a 71 year old. . . And he took this shot really go…", "RT @realDonaldTrump: Consumer Sentiment in the month of May is the highest in 15 years. Very nice! @FoxNews", "RT @RyanAFournier: If you cheat to get into college, you go to jail...\n\nBut if you cheat to get into the United States, you get to go to co…", "RT @GovernorKayIvey: Today, I signed into law the Alabama Human Life Protection Act. To the bill’s many supporters, this legislation stands…", "RT @kjune65: 🛑 Stop whatever you’re doing and listen to this. TRUTH. \n@SpeakerPelosi @SenSchumer\n\nhttps://t.co/1QZYxxEhHq", "RT @Anon_decoder: https://t.co/sBB9al1Dg3", "RT @realDonaldTrump: We stand firmly, strongly, and proudly with the incredible men and women of law enforcement. You do not hear it nearly…", "RT @RealCandaceO: Margaret Sanger, the founder of Planned Parenthood, was an evil genius. She said she hoped to “exterminate blacks like we…", "They are.  Little ole me lost about 40 followers.  Freaking twitter! https://t.co/KSjC05te0K", "RT @charliekirk11: Today, Josh Hawley introduced a new Senate bill that would restrict important technology such as AI &amp; 5G from being expo…", "RT @RudyGiuliani: How the Mufti of Jerusalem Created the Permanent Problem of Palestinian Violence - The Tower - The Tower\nThis is the trut…", "RT @RudyGiuliani: Rep.Tlaib’s fond memories of how kind her ancestors were to the Jewish people ignores the historical fact that during WW…", "RT @DineshDSouza: Tell us Rashida Tlaib, did the Muslim grand mufti of Jerusalem meet with Hitler in 1941 to convey his strong opposition t…", "RT @usminority: Capitalism WILL work, if you do. \n\nNobody owes you a damn thing just because you’re here.", "RT @charliekirk11: Did you know:\n\nUnder a new Trump Administration rule, drug companies will now be required to disclose drug prices on TV…", "RT @realDonaldTrump: Democrat Rep. Tlaib is being slammed for her horrible and highly insensitive statement on the Holocaust. She obviously…", "RT @RSBNModerator: @realDonaldTrump @OANN How about those 300+ million views @RSBNetwork got during the 2016 campaign @realDonaldTrump? We…", "RT @mamendoza480: I’m sitting here at 1:20am on 5/12/19. Five years ago right now was when the drunk ILLEGAL ALIEN ran head on into my son.…", "RT @charliekirk11: In 2 years, @realDonaldTrump has done more to address \"income inequality\" than @BernieSanders has in 38 years in governm…", "RT @RyanAFournier: The media won’t believe Attorney General Barr, but they believed Jussie Smollett. \n\nLet that sink in.", "RT @realDonaldTrump: James Comey is a disgrace to the FBI &amp; will go down as the worst Director in its long and once proud history. He broug…", "RT @charliekirk11: .@realDonaldTrump's new nominee to Secretary of Defense is an excellent choice\n\nJust yesterday, he announced that the Ar…", "RT @BreakingNLive: WATCH: Today is WW2 victory day. All Nazi symbols and flags were destroyed: https://t.co/ntsUp2Vl64", "RT @RedNationRising: Remember that time a US President colluded with Russia with cameras rolling &amp; an open mic : ) #PutinsGOP https://t.co/…", "RT @ILMFOrg: The U.S Is 3rd In The World For Murders, But If You Remove\n\n1) Chicago\n2) Detroit\n3) D.C\n4) St. Louis\n5) New Orleans\n\nThe U.S…", "RT @dbongino: No sweat, this is how our Marines head to breakfast in the morning. https://t.co/sSogZ9ioXC", "RT @Education4Libs: Liberals are freaking out on Trump for not releasing his tax returns even though he’s not required to do so.\n\nYet they…", "RT @charliekirk11: Why did the liberal 9th Circuit decide to allow asylum seekers to stay in Mexico?\n\nApril 9th: Court blocks rule to allow…", "RT @RyanAFournier: Let this sink in…\n\nThe Chicago Police Department gathered more evidence on Jussie Smollett in two weeks than Mueller gat…", "RT @charliekirk11: Official IRS Taxpayer Bill of Rights:\n\nThe Right to Confidentiality\n\nTaxpayers have the right to expect that any informa…", "RT @realDonaldTrump: ....Guess what, that’s not going to happen! China has just informed us that they (Vice-Premier) are now coming to the…", "RT @realDonaldTrump: “The real “Obstruction of Justice” is what the Democrats are trying to do to this Attorney General.” Congressman Jim J…", "RT @Education4Libs: A Seattle school district wants their teachers to bless their Muslim students during Ramadan.\n\nWow....\n\nThat is NOT a t…", "RT @dbongino: Garbage Disposal Confounds AOC: \"I don’t know what to use it for...Like, food scraps?\" https://t.co/XqZfY2jOrp", "RT @charliekirk11: .@JoeBiden voted against amendments to a trade bill with China in 2000 which would protect religious minorities from Chi…", "RT @DonaldJTrumpJr: And sadly both Democrat leadership and their presidential candidates are still too cowardly to stand up to her, no matt…", "RT @charliekirk11: Did you know: \n\nU.S. has 3.5 Million more registered voters than living adults\n\nVoter fraud is real.", "RT @JackPosobiec: Twitter suspends @AOCPress and Orthodox Jew Michael Morrison https://t.co/8JwCaWkBCi", "RT @AbbyJohnson: Hey @BrianSimsPA, how about I let you know next time I’m standingon the sidewalk advocating for life? Let’s see how powerf…", "RT @usacsmret: I am more than a little sick of hearing Democrats make the ludicrous claim that Obama is responsible for the current economi…", "RT @JackPosobiec: BREAKING: ICE announces program to allow local police and sheriffs to arrest and detain illegal aliens for up to 48 hours…", "RT @GordonGChang: Raise the tariffs until #China stops stealing our tech and stops violating its trade promises. No tariff rate is too high…", "RT @RedNationRising: What happens when Mueller Time ends? You have to pay the Barr Tab. https://t.co/CnGzzhhMfi", "RT @RudyGiuliani: I consider Judge Napolitano to be a friend so I write this with regret. An obstruction case where there is no proof of an…", "RT @PrisonPlanet: @realDonaldTrump Thank you Mr. President. Now hopefully Facebook will be stripped of its immunity under section 230 of th…", "Somebody put this viewing order together.  I thought it was cool.  I still haven’t seen Endgame yet but will soon! https://t.co/MAOuaf2CL3", "RT @elguapo64: A high school senior in Texas just ran a 100-meter dash in 9.98 seconds — that's fast enough to be an Olympic final. Runner…", "Antifa is a domestic terrorist organization.  They always attack the weak.  Funny how they never attack us stronger folks or those that open carry. https://t.co/7noAVU4U8G", "RT @Kellie2727Paula: This is great so let’s make it spread everywhere. https://t.co/ExzgHVG8bI", "RT @jaliisah2: @mitchellvii @BreitbartNews Of course the Democrats want President Trump's tax cuts repealed. They are working! The economy…", "RT @KayaJones: To anger a Conservative, lie to them.\n\nTo anger a Leftist,  tell them the truth.", "RT @charliekirk11: No issue has a bigger impact on Hispanics in the United States than illegal immigration\n\n@RepDanCrenshaw lays it out PER…", "RT @RedNationRising: Under Trump's Leadership:\n\n• 5.3M new jobs\n• 600k new manufacturing jobs\n• 5M lifted off food stamps\n• Lowest unemploy…", "RT @DeepStateExpose: @realDonaldTrump @nytimes Retweet: Never before seen footage of the moment the U.S. defeats ISIS!!! #Trump2020 https:/…", "RT @ScrewedHumans: Democrats love politically uneducated Americans who are easily manipulated by emotion and not facts. It is surreal to wa…", "RT @DeepStateExpose: @realDonaldTrump https://t.co/QfoWkiyuUj", "RT @charliekirk11: RT this video so the media can’t ignore\n\nCreepy Joe. \n\n https://t.co/ljemkMrBnl", "RT @1776Stonewall: https://t.co/pkDtEdwsFG Hypocrisy! Biden Once Voted In Favor Of Restoring Robert E. Lee's Citizenship, MSM Dead Silent.…", "RT @realDonaldTrump: Thank you to brilliant and highly respected attorney Alan Dershowitz for destroying the very dumb legal argument of “J…", "RT @DeepStateExpose: @realDonaldTrump https://t.co/hG4RCCCMQD", "RT @realDonaldTrump: Just out: Real GDP for First Quarter grew 3.2% at an annual rate. This is far above expectations or projections. Impor…", "RT @AZFreePatriot: Café that charged a ‘man tax’ and gave women priority seating is going out of business. 😂😂😂👏🏻👏🏻 #DiscriminationOfMales #…", "RT @UncleSamsChild: #OTD 1976: #USMarine Corps Reserve veteran, MLB player Rick Monday saves the #American flag from being burned by two pr…", "RT @LisaMei62: Great interview w/Joe diGenova on his reaction to the Mueller report. He has 2 questions: Why did Mueller have to sign a wai…", "RT @charliekirk11: Fact:\n\n@AOC tweeted about the horrific tragedy in New Zealand 14 times\n\nShe tweeted about the attack on Christians in Sr…", "RT @charliekirk11: Illegals should not be counted in the census\n\nBasic projections show that California gets an extra 9 electoral votes bec…", "RT @GordonGChang: Problem: #KimJongUn is going to meet #VladimirPutin Thursday to get cash in violation of #UN sanctions.\n\nSolution: Sancti…", "RT @JackPosobiec: Here is the Boston Bomber placing a bomb in front of an 8 year-old child \n\nToday top Democrat Bernie Sanders endorsed his…", "RT @RedNationRising: The U.S is 3rd in murders throughout the world\n\nIf you remove\n\n1) Chicago\n2) Detroit\n3) Washington D.C\n4) St Louis\n5)…", "RT @JackPosobiec: PATHETIC: Pro Sports Team Rips Down Statue Of 'God Bless America' Singer https://t.co/NOvFf0YqGD", "RT @DanielTurnerPTF: Remember all of those countries who criticized President Trump for leaving the Paris Climate Accords? \n\nChina’s CO2 em…", "RT @realDonaldTrump: Thank you @MarkLevinShow! #MAGA https://t.co/kff84hFgKP", "RT @RealJack: President Trump, The Only Man Who Could:\n\n-Get A Refund From A Prostitute\n\n-Sell Rice To China\n\n-Get Sanctuary Cities To Refu…", "RT @realDonaldTrump: Happy Easter! I have never been happier or more content because your Country is doing so well, with an Economy that is…", "RT @dbongino: He lives!\nAnd thanks to His Grace, Glory, Sacrifice, and Love, so do I. \nHappy Easter everyone. https://t.co/9e0HMvLmgM", "RT @DeepStateExpose: @realDonaldTrump RETWEET: Lock Obama up for collusion &amp; treason!!! https://t.co/Mrj3sV5dKC", "RT @LarrySchweikart: He is Risen!", "RT @RyanAFournier: 200+ Christians were murdered by radical Islamists on one of the holiest days of the year. \n\nI hope liberal pundits reac…", "RT @JohnWHuber: BARR press conference\n\n✔︎ No Collusion\n✔︎ No Obstruction\n✔︎ Trump asserted no privilege claims\n✔︎ \"Unfettered\" access to te…", "RT @AZFreePatriot: #WussGeneration #SuckItUp #MillennialGenerationSnowflakes https://t.co/Vzi3W0miZL", "RT @UncleSamsChild: A stranger walked into a 12-year-old girl's room wearing no pants. \n\nThe Louisville homeowner shot the man 6 times.\n\nA…", "RT @EmeraldRobinson: Notre Dame fire: The owner of the restoration company - which is very highly regarded - says that absolutely none of h…", "RT @AZFreePatriot: #RadicalMuslims have targeted &amp; successfully damaged/vandalized over 800 Christian churches in France. https://t.co/8S0B…", "RT @luluHru: #LulusCaboose 💯 % MAGA F/FB RT 2 Ride \n@MichaelDadiego \n🇺🇸@RainDownFire \n@janal811 \n@mycldean \n@Kentleitch1 \n@Juliananana1 \n@3…", "RT @charliekirk11: Conservative \"rhetoric\" incites violence?\n\nTell that to the @TPUSA chapter leader who had his dorm room firebombed\n\nOr t…", "RT @realDonaldTrump: Just signed a critical bill to formalize drought contingency plans for the Colorado River. Thanks to @SenMcSallyAZ for…", "RT @DiamondandSilk: White Liberals harass a black woman (@RealCandaceO ), yet the Democrats tried to deem her as the White Nationalist.  Th…", "RT @AndrewPollackFL: Over the last month, 12 Catholic churches have been attacked in France. \n\nFrench officials: silent\nChurch officials: s…", "RT @DonaldJTrumpJr: Even the New York Times is being reluctantly honest about tax cuts. Funny watching the TV pundits try to lie and preten…", "RT @RobertJohnDavi: Why are’nt we hearing more about this and by whom - if the story was 875 mosques were vandalized I sure as heck would w…", "RT @BrianQuinn36: Shocking that the Notre Dame Cathedral would be engulfed in flames right at the start of the #HolyWeek. Given the recent…", "RT @RyanAFournier: Not jumping to any conclusions, but the Notre Dame fire follows months of arson, vandalism and desecration of French Cat…", "RT @charliekirk11: 3.9% unemployment\n\nKorean War is over\n\nLargest tax cut ever\n\nISIS destroyed\n\nUS energy independent  \n\n3 million + jobs c…", "RT @JackPosobiec: Did You Know:\n\nBoston Bomber Tamerlan Tsarnaev was recruited as an FBI informant under Robert Mueller\n\nHe was recruited a…", "RT @realDonaldTrump: Spoke to @TigerWoods to congratulate him on the great victory he had in yesterday’s @TheMasters, &amp; to inform him that…", "RT @NewsBreaking: BREAKING: The roof of the Notre Dame Cathedral has collapsed into the church https://t.co/8caUCgVlQp", "RT @RealJamesWoods: He owns them... ⁦@realDonaldTrump⁩ https://t.co/LJstYx6Sh2", "RT @JackPosobiec: Congratulations Tiger Woods! https://t.co/0Nz8H18Gss", "RT @realDonaldTrump: Congratulations to @TigerWoods., a truly Great Champion!", "RT @RedNationRising: Soros’ huge influence in the U.S. government: Obama's State Department pressured Ukraine officials to drop an investig…", "RT @Shanika91405419: Wow,, so heartless https://t.co/zFwqDdl7mF", "RT @NinaLachmatova: @Christi77929362 @yo_mals @RobChristie11 Valeria Jarrett's Stanford Yearbk. Vowed to make the USA a Muslim Nation. EVIL…", "RT @Piper_Fogle: LEAKED: Obama Team Kept List of Muslims For Top Jobs, Excluded Non-Muslims\n\nIt was revealed in Podesta’s hacked emails rel…", "RT @DanCrenshawTX: Just so we are clear on basic notions of reality:\n\nWhen someone calls out a public official for things they said, it is…", "RT @realDonaldTrump: Finally, great news at the Border! https://t.co/nofzYa2Qs7", "RT @NewYorkGOP: Democrats just rejected tuition assistance for Gold Star families but approved it for illegal immigrants. Would these Democ…", "RT @RedNationRising: BEST⭐️ANSWER⭐️EVER\n\n“Where did God come from?”\n\n https://t.co/3hVy0drIHN", "RT @RedNationRising: Unbelievable! Democrats just rejected tuition assistance for Gold Star families but approved it for illegal immigrants…", "RT @UncleSamsChild: Rep Ilhan Oman: 9/11 was \"Some people did something\"    Here's your something    2,977 people dead by terrorism https:/…", "RT @DonaldJTrumpJr: This woman is a disgrace. Never in my life would I imagine a member of congress showing this much disdain for America &amp;…", "RT @ReneeCarrollAZ: Former sex slaves are setting fire to their burqas that they were forced to wear by IS!S.\n\nThank you, @realDonaldTrump…", "RT @AZFreePatriot: NY Assembly: $27 million in financial aid for illegal alien college students but ZERO for the Gold Star Families' colleg…", "RT @1776Stonewall: This is how dumb leftists are: They acknowledge intel agencies had spies in Trump campaign, but they don't call it \"spyi…", "RT @HawleyMO: Twitter admitted to me today that they have protocols they use to determine when speech is offensive. So release the protocol…", "I’ll NEVER FORGET 9-11!  Ilhan Omar can kiss my ass! https://t.co/rj35VmE4mq", "This Tweet from @AZSpaceForce has been withheld in: Italy.", "RT @smalltownandrew: Omar : “To me, the hijab means power, liberation, beauty, and resistance.”\n\nDoes this look like women who have power,…", "RT @Serremmy: E4T XPRESS🌗1465🌗\n@fins4evr\n@jonz970\n@lidgar22\n@ctanner3\n@SLA1500\n@raducom\n@blynsinop\n@RodHillis1\n@Serremmy\n@Boss89011\n@LisaLy…", "RT @DonaldJTrumpJr: Wow. Well done @RealCandaceO!!! Great to see someone call out the Dems on their purposeful manipulation of facts for th…", "RT @LouisTakiando: @Willsdarlin @HillaryClinton She’s an idiot and she farts too.  @AOC @RepAOC is going to try and do away with her and th…", "RT @RedNationRising: Ewww… no wonder she's such a cranky old goat https://t.co/bzP6yN7TQJ", "RT @JackPosobiec: 1.5 Million views https://t.co/WLVtqdLPba", "RT @Education4Libs: Cory Booker is introducing a bill on slavery reparations.\n\nWow....\n\nSo I’m supposed to pay someone for something I neve…", "RT @RealJamesWoods: Hey, all, here is a resource that may save a life. Give a read and a retweet, please. #END22 https://t.co/cIIqRhewRU", "RT @RobChristie11: Baby elephant wants to cuddle. https://t.co/uy5pOMz7RV", "RT @dbongino: Wide bipartisan agreement that this is the greatest catch of all time. #BottomsUp https://t.co/GYNXEtEkxf", "RT @luluHru: #LulusCaboose F/FB RT 2 Ride 💯 % MAGA get connected \n@karl_lepak \n🇺🇸@Woopy2011\n@Marie_Kelly1124\n@TheNyliJ \n@trekkie419 \n@johnc…", "RT @NewsBreaking: NEW: Rhino poacher trampled by an elephant and then eaten by lions\nhttps://t.co/1E5h8YPVOR", "RT @charliekirk11: When the FBI was concerned that the Chinese were trying to infiltrate Senator Dianne Feinstein's Senate staff, they info…", "RT @odonnell_r: On a follow-up to last nights video, never square up to a Police Officer who’s not afraid to use force when necessary. http…", "RT @GeorgePapa19: @realDonaldTrump Mr. President: an FBI asset told me that the “Russians have emails.” Mueller lied to the world. This was…", "RT @luluHru: #LulusCaboose 💯 % Maga F/FB RT 2 Ride \n@misspunk63 \n🇺🇸@RevKeithBritt \n@belaende \n@SteveD77166341 \n@Chriso51 \n@luluHru \n🇺🇸@ctan…", "RT @GeorgePapa19: I was so disturbed by Alexander Downer’s behavior and spying on me at our meeting that I reported him to both the FBI and…", "RT @charliekirk11: Did you know:\n\nThe USDA has been experimenting on cats &amp; kittens for years often resulting in death to the animals\n\nThe…", "RT @charliekirk11: HUGE.\n\n@realDonaldTrump is polling through the ROOF with Hispanic voters\n\nAccording to a new poll, Trump's approval rati…", "RT @Trump454545: Can someone please remind me exactly what Obama did for the black community? \nSurely he signed bills to revitalize urban c…", "RT @RealJack: The Border Wall Is Estimated To Cost Each Taxpayer Just $17\n\nRT If You Would Pay Your Share🙋🏻‍♂️", "RT @RealJack: In THREE Days, I Will Be Giving Away Trump Hats To THREE Randomly Selected People Who RT This Post &amp; Follow @ILMFOrg", "RT @AZFreePatriot: @AOC @jacobsoboroff @AOC  is child sex trafficking funny to you?? Human trafficking funny? Illegals dying in the desert…", "RT @realDonaldTrump: WELCOME BACK JOE! https://t.co/b2NbBSX3sx", "RT @spengjr: Star Wars was filmed in Tunisia, where homosexuality can be punishable by 3 years in prison and abortion is illegal after the…", "RT @charliekirk11: Chick Fil A is America at its best\n\nFamily owned\n\nReverent to God\n\nObedient Christ followers\n\nTithe their earnings\n\nEmpl…", "RT @Jamierodr14: .Schumer, Pelosi and all the Democrats have obsessed over Russia and Putin for 2 years now. I think it’s time we start inv…", "RT @Anon_decoder: Creepy Joe Biden 2020!!\nPinching a girl’s nipple\n#Biden2020 \n\nhttps://t.co/qczUnRtoqV", "RT @ConservativePTZ: Hide your cats from Joe Biden! 😂 https://t.co/cOZyRSlez6", "RT @AbbyJohnson: Look who we just passed in followers. 😁 #unplannedmovie https://t.co/PCFY7EPp0A", "Just more liberal tyranny.  I know I’ll be seeing this movie to support the pro life movement! https://t.co/lOA3zLFsck", "RT @ARmastrangelo: https://t.co/TfDx6TIoeo", "RT @realDonaldTrump: On this Vietnam War Veterans Day, we celebrate the brave Vietnam Veterans and all of America’s Veterans. Thank you for…", "RT @charliekirk11: Facts:\n\nFemale unemployment lowest in 65 years\n\nTrump’s SBA lent $500 million more to women-owned businesses in 2017 tha…", "@IlhanMN Fuck you and your radical shit.  What should we do?  Open the flood gates to every person wanting to come to America?  Think!  It’s time to fight for the USA, not destroy it bitch!", "Stop Whining, Millennials, You're The Most Prosperous Generation Ever https://t.co/QOPOi7Dirq", "RT @GenChuckYeager: March 26, 1948, 71 yrs ago today: Someone had to do it. https://t.co/yJjQqdrKzi", "RT @charliekirk11: Democrats in 2015: Eveyone must accept results of the election\n\nDemocrats day after the election 2016: We do not accept…", "RT @catturd2: Good morning to everyone except Kim Foxx who is everything that’s wrong with our evil, corrupt, rotten to the core, two-tiere…", "RT @TimRunsHisMouth: WATCH:  Mike Lee officially became a General in the Great Meme War on the floor of the Senate... \n\nHe used Reagan on a…", "It must be the beer but I keep seeing Bill Barr as @eltonofficial (Elton John).  Maybe with a few style tips...#bennieandthejets https://t.co/eQ53CJ9cq0", "RT @JackPosobiec: I don’t care if the Jussie case is sealed. I’m posting this. Share it far and share it wide. https://t.co/c3DKhM1wg3", "RT @RealJamesWoods: This... 👇 https://t.co/zp8fyjft9w", "RT @RedNationRising: OTD Seven years ago, the REAL Russian collusion https://t.co/tmHdSKoNvb", "Two-tiered justice system 👇🏻 https://t.co/4ZXcuWF68B", "RT @charliekirk11: What a 7 days:\n\nISIS totally destroyed ✅\n\nGolan Heights recognized ✅ \n\nMueller vindicates Trump ✅\n\nJustice department sa…"]