["Iran Says New Sanctions ‘Close the Door’ on Diplomacy With U.S.\n\nBolton says U.S. leaving door open for negotiations, all Iran needs to do \"is walk through\"\n\nhttps://t.co/UU0D9itttR", "U.S. national security adviser John Bolton said a military strike on Iran is still an option and warned against viewing President Trump’s decision to call off an attack as ‘weakness.’ https://t.co/gY9iGancvi", "Despite U.S. sanctions, Iran's Revolutionary Guards keep afloat with infrastructure projects in Syria and Iraq\nhttps://t.co/xAN0eOcHe2", "RT @JoshNBCNews: Israel Unveils New Settlement in Disputed Golan Heights Named ‘Trump Heights’ - @wsj’s @dovlieber  https://t.co/5X13J0xBHY", "- DOJ antitrust chief tells Tel Aviv crowd big tech companies can violate antitrust laws not just with high prices, but also by lowering quality (e.g. privacy issues)\n\n- Comes after @brkend reported DOJ will open probe into Google\n\nhttps://t.co/iy9qUdcVDK\nhttps://t.co/2j61bqoFW5", "RT @felschwartz: I spent some time trying to explain what I had increasingly heard in conversations in Ramallah: that a growing number of P…", "Modern problems with ancient roots. \n\nCheck out this out-of-left-field issue with a planned cable car line from new city of Jerusalem into the old city. https://t.co/9TP8z5cywN", "RT @felschwartz: Reupping our January story on the long running tussle over ultra-Orthodox in the military: https://t.co/QZZOU2y7G8", "Israel is heading to elections again, after holding a vote in April. \n\nPolls show a near identical results expected for these upcoming elections. \n\nSo what's it all about? \n\nhttps://t.co/hOv6ve5nJS", "RT @michaelkamon: Here we go again. Netanyahu can't form a government, and Israel is headed for new elections. @felschwartz @DovLieber http…", "Sara Netanyahu accepts lesser charge over accusation she misused Israeli state funds for expensive meals despite having in-house chef https://t.co/6rsj40Aqtz", "RT @felschwartz: If Israelis go to elections, Bahrain conference next month still expected to go ahead - but of course this could all chang…", "RT @felschwartz: Palestinian Prime Minister @DrShtayyeh says Palestinian officials were not consulted about the Trump administration's econ…", "Eurovision Presents a Test for Israel’s Sunny Tourist Vision\n\nhttps://t.co/l4TSjxS9UW", "Qatar is sending Palestinians $480 million in grants expected to help pay for health, education and electricity—and also buy a few weeks’ peace with Israelis after deadly spasm of violence https://t.co/9g8OPrbWzj", "Israel and Gaza engaged in some of the worst fighting in months, with hundreds of Palestinian rockets raining down across the border and Israeli airstrikes hitting over 200 targets. https://t.co/rMuxXScivL", "Israel, Gaza Trade Blows in Deadly Exchanges\n\nhttps://t.co/aYjOmgZomA", ".@amazon is slowly moving into Israel. This week it began inviting Israeli companies to market products on its website. \n\nBut the first real Middle East Amazon website was just opened in the UAE, in both English and Arabic.\n\nhttps://t.co/c452N8iYgt", "Benjamin Netanyahu may have won a fifth term as prime minister, but his coalition is already looking “very, very fragile” https://t.co/FmiPcp88Ew", "“We live in a world in which the left has never been in power and we’ve never seen what the left can do. We’ve grown up in the world in which we’re told the left is a catastrophe” https://t.co/bMZrkb0vdq", "‘The hope or yearning for peace is foreign’ to Israeli millennials pushing the country to the right  https://t.co/3Lr4OxXN08 via @WSJ", "RT @adamrasgon: On election day, I asked 22 Arab residents of Tamra and Shfaram if the cameras Likud placed in polling stations intimidated…", "With nearly all the votes counted, Benjamin Netanyahu is likely to remain Israel's prime minister &amp; begin soon his 5th term as Israel's leader. \n\nhttps://t.co/2aDoNlP8YF", "stay tuned!\n\nIsraeli Exit Polls Show Tight Race\n\nhttps://t.co/RsxcVu3lv9", "Election fever in Tel Aviv. https://t.co/pTQMWi4tfs", "Will Israelis give Benjamin Netanyahu another term in office? Israel’s parliamentary election appears to be heading towards a close finish https://t.co/0zMejRUMiW", "RT @felschwartz: Today is the day. As Israelis hit the polls, I wrote yesterday about all of the calculations freaking Bibi out https://t.c…", "RT @adamrasgon: Omani FM Yusuf bin Alawi tells @TimesofIsrael US peace plan will fail if it doesnt mention a Palestinian state\n https://t.c…", "Benjamin Netanyahu has changed Israel’s political landscape and its role on the world stage, contributing to and benefiting from the country’s rightward shift. Via ⁦@felschwartz⁩  https://t.co/cbqeBCPJUK", "RT @michaelkamon: My favorite part of editing this Moshe Feiglin story, apart from working with @DovLieber, was finding this out: Israeli w…", "RT @felschwartz: Will Israel's elections come down to pot? Maybe. @DovLieber explains https://t.co/9sQIVxKOPZ", "RT @adamrasgon: “We welcome you into our village and then you ask us to remove our belts and lower our pants,” one resident said\n\nInvasive…", "Did you know?\nAccording to available Info from the UN, Israel has the highest percentage of cannabis smokers anywhere in the world. https://t.co/P1XBWWsmTR", "The Potential Kingmaker in Israel: An Ultranationalist Who Wants to Legalize Pot\n\nhttps://t.co/2yVdFlHp17", "RT @felschwartz: Israel's elections are a week away and the race is getting vicious https://t.co/H9nzPt0TMn", "Free at Zehut event, a pro cannabis party in Israel election.\n“Free the plant, “ the lighter says. https://t.co/LhCiuIhAeU", "@yonibrander Bravo", "Breaking news out of central Israel: \n\nShulman, a flamingo, escaped his cage and is calmly walking through a busy highway. \n\n(He's alright &amp; back in the zoo)\n\nhttps://t.co/kdiXKmiOIw", "The slow heal of wounds in Gaza https://t.co/hOfVKZc9ou", "Iran's hearts and minds campaign in Syria:\n\n\"To Syrians battered by war, Iran is offering cash, food, Iranian ID cards, public services and free education.\"\n\nVia @RajaAbdulrahim &amp; @benoitfaucon\n\nhttps://t.co/DORTLrf96u", "This month Mohamed, a Gazan, was on his way to the pharmacy when he witnessed demonstrations against Hamas. He said people were calling for “life with dignity” and protesting the high cost of living.\n\nhttps://t.co/NYi5UKZJTj", "Israel now carrying out intense airstrikes in Gaza. \n\n- Military says it hit secret Hamas headquarters as well as interior ministry building. \n\n- At least one injured in Gaza so far. \n\nFor more updates, see: https://t.co/Nud1G4TNLA https://t.co/Q13RjTG3gW", "Gaza Rocket Attack Injures Seven in Israel\n\n- Israel blames Hamas and is sending 2 additional brigades to Gaza border as it prepares to respond. \n\n-Netanyahu will cut short his U.S. visit to manage response from Israel. \n\nhttps://t.co/pJO2FXpABN", "@skominers Yup, sent you an email.", "RT @BenjaminSales: Meet the new weirdest Israeli campaign ad. Ayelet Shaked, leader of the New Right party, models a perfume called \"Fascis…", "Benny Gantz is the biggest threat to Israeli Prime Minister Benjamin Netanyahu’s reelection. He’s also an introvert and political novice whose campaign has begun to struggle. https://t.co/zqy87amK3e", "):\n\nCan a Facebook Post Make Your Insurance Cost More?\n\nhttps://t.co/vkcBWge6Vj", "Israel says two rockets fired from Gaza toward Tel Aviv, raising tensions https://t.co/Hq8dI1Ip0x", "Will the U.S. recognize the Golan Heights as part of Israel? \n\n@felschwartz brings us the political and security context that may lead to this policy change. https://t.co/AunS48AObv", "Israel said a Hezbollah operative accused of killing U.S. troops is establishing a terror network in the disputed Golan Heights  https://t.co/ET52wPRtAM via @WSJ", "They both want Netanyahu out of office. But can they work together? \n\nhttps://t.co/3HM0JbUvEm", "In an interesting decision today,\n\nIsrael recognized a victim of sexual assault by a Palestinian as a \"casualty of hostile action\" (read: terrorism), &amp; granted her rights to receive full compensation. \n\nThe \"nationalistically-motivated\" assault occurred in Holland in 2003.", "Cloistered Saudi Arabia is planning to open its doors by offering this year visa-free access to tourists from the U.S., Europe, Japan and China https://t.co/Ut5FRYdoIk", "RT @RaphaelAhren: Likud MK Benny Begin blasts PM @Netanyahu for ‘trying to assassinate public trust’ in law enforcement https://t.co/4Zp4lu…", "RT @felschwartz: Israel's @netanyahu shares a clip from @foxandfriends, whose hosts fault the \"deep state of Israel\" for the AG's decision…", "@AAhronheim Thanks for the tip (:", "U.N. calls for further investigation into whether Israel committed war crimes and crimes against humanity in its crackdown on Gaza protesters https://t.co/NReE5QpGvK", "“In my view, the culture of corruption in government, and above all bribery offenses, can pose a real threat to Israeli society”\n\n-- Avichai Mandelblit https://t.co/ypAEfkjc3d", "Who is Israel's Attorney General Avichai Mandelblit, the Netanyahu appointee who is expect to indict his boss for bribery? \n\nhttps://t.co/t2hFKuQAB3", "@ScottGross89 Did you read the story, Scotty?", "An incredibly important development for the U.S. and the region. https://t.co/Ubne8Uz5Oh", "Plan by former Defense Minister Avigdor Lieberman to make apartments for young \nIsraeli couples affordable: \n\nLet them dip into their pension funds, tax free. (: https://t.co/SD9fuNE10B", "In so called \"honor killings,\" the youngest boys in the family are often coaxed by their elders into sororicide. \n\nhttps://t.co/uWCW5Uv87v", "Israel and hi-tech, a symbiotic relationship? Not always, reports ⁦@felschwartz⁩  https://t.co/leK2LWL8PO", "Netanyahu’s two main rivals are joining forces for April’s elections, a move that poses a serious challenge to the right-wing leader’s bid for a record fifth term https://t.co/vAWKXuwwiR", "‘Spreading Like a Poison’: Anti-Semitic Acts Increase in France\n\nhttps://t.co/nXgxRgxiA9", "Not alternative history, but actual history. https://t.co/93zw8u8wNd", "RT @Kate_OKeeffe: Israel is finally creating a CFIUS process, per @felschwartz\nU.S. national security measures like CFIUS and export contro…", "Nevertheless, business between Israel &amp; China is good.\n\nIn the first 3 quarters of 2018,  Chinese investors were involved in all 17 financing rounds for Israeli startups of $20 million or more. https://t.co/92va7Ix9RA", "I spoke with a few Israeli drone company heads who would not go on the record about this issue. Drones are big in Israel &amp; in China. But the politics makes business tricky.", "--Some Israeli tech companies are hesitant of doing business with China b/c it could hurt them in the U.S. market.\n\n-- This is especially true of companies that make \"dual-use\" products: products that have both civilian &amp; military use,  like drones &amp; batteries.", "Chinese Investment in Israel Raises Security Fears\n\nhttps://t.co/w2tbegyMFP", "@KelseyOgletree @WSJ Thanks Kelsey", "RT @pwonacott: America’s military ally in Syria, the SDF, is delivering oil to a broker for the regime, helping Assad evade sanctions https…", "Israel desperately needs another med school. Most Israeli doctors now trained in Europe. \n\n@naftalibennett decided he would try to build it in Uni Ariel, located in the West Bank.\n\nToday, his plan fell apart after education council voted no months after project began", "RT @reglash: So does \"Toy\" sound like it was inspired by \"Seven Nation Army\"? \n\nYou can decide for yourself, but legally - it's been decide…", "@felschwartz Not in the story: We spoke w/ a senior Likud activist who compared Netanyahu to the biblical Moses (Moshe) &amp; said his picture should be hung on every doorpost.", "Trump Plays Starring Role in Netanyahu’s Re-Election Bid\nvia @felschwartz\n\nhttps://t.co/VKZo0EFNXO", "After a missile fired from Syria forced this Israeli-run ski resort closed, two days later it was at max capacity again.  \n\nhttps://t.co/EBgSC3yWIu https://t.co/XiXl4qoln0", "Bill To Counter Israel Boycott Movement Passes Senate\n\nhttps://t.co/x17NGWRpIg", "“Peo­ple come from all the dif­fer­ent com­mu­ni­ties, all the col­ors, and it’s to­tal chaos,” said Guy Baron, 30, a soft­ware en­gi­neer who drove from Tel Aviv for his first ski trip. “But at the end of the day, it’s fun,” he said.", "Hint: it’s in the Golan Heights", "Soldiers and Ski Lovers Converge on a Snowy Mountain In Middle East. https://t.co/EBgSC3yWIu", "RT @FirasMaksad: Hafez Al Assad reportedly expressed sorrow to Bandar on killing of Israel PM Rabin, explaining deep regret for not seizing…", "(4) Since Gantz's speech, Likud has been rapidly repeating their main attack against him.\n\n\"Gantz is left-wing. Don't be fooled.\" https://t.co/SKgLXsz2fq", "(3) Gantz attacked Netanyahu's status as the \"king\" of Israel, but w/o ever using his name. \n\n\"The basic values of Israeli statehood have been converted into the mannerisms of a French royal house,” he said. https://t.co/wg76Fu91Op", "(2) “If it turns out that there is no way to reach peace at this time, we will shape a new reality. Even if we cannot make peace with our neighbors, we will work hard and reach peace within ourselves,\" he said.", "(1) Gantz so far the only major candidate to discuss \"peace.\"\n\nPeace with the Palestinians -- he says he'll try but he's not optimistic. His current positions are incompatible w/ an independent Palestinian state. \n\nHe says peace between Israelis themselves is his main target. https://t.co/lQ2j73qBc7", "Former Israeli Army Chief Benny Gantz Launches Challenge to Netanyahu\nhttps://t.co/Dylv2AqSda", "Netanyahu’s main challenger Benny Gantz getting his campaign started tonight with his dance-inducing music, “No more right or left. Israel above all else.” https://t.co/3rkZG3bJjD", "Trumpian slogans of 3 Israeli parties for April elections: \n\n\"Make Israel great again\"\n\n\"Israeli will return to winning again\"\n\n\"Israel before everything\"", "Israel Hits Iranian Targets in Syria After Attack on Golan Heights\nUpdated with commentary from @DanielBShapiro, @AliVaez &amp; Yaakov Amidror\nhttps://t.co/CNHTB6OaiY", "Israel Hits Iranian Targets in Syria After Attack on Golan Heights\n\nhttps://t.co/9B3JRm6Cw1", "Mandelblit's Chavruta, (Torah study partner), says he hasn't seen for him over a year cause he's so consumed with the Netanyahu cases. \n\n“Once he starts something, he does as best as he can...He doesn’t cut corners.” https://t.co/5l20f2FRer", "As an election approaches, Avichai Mandelblit, Israel’s low-key attorney general, is under intense pressure from Prime Minister Netanyahu and the public https://t.co/t2hFKuQAB3", "The request was made by @AmbJohnBolton and it rattled officials in the Pentagon &amp; State Dept @DionNissenbaum  reports https://t.co/WKhQTITBxh", "After two attacks near U.S. facilities in Iraq last year, the White House asked the Pentagon for military options to strike Iran in response https://t.co/Nr7zvDoDf7", "Gonen Segev a former Israeli minister has pleaded guilty to spying for Iran, the country’s bitter enemy https://t.co/pZTaQffOSF", "The Palestinian Authority is struggling to implement a social security program. Why? \n\nB/C Palestinians fear corruption. They fear they'll never get back money put into the program. \nImportant work by @adamrasgon1\n\nhttps://t.co/IPfp1MUccg", "RT @WSJMidEast: “I’m sure some ladies would like to have some gold stuck in their teeth.” Gold food makes pretty pictures, but messy eating…", "Did you know that the @WSJ  has a whole section dedicated to A.I.\n\nTake a read and see the future. \n\nhttps://t.co/qiDzmVEu0S", "RT @JackyHugi: زيارة الوفود العراقية الى اسرائيل بدعوة حكومية: لم يكون من بين الزائرين اي نائب او مسؤول رسمي, وكل ما تم نشره بهذا الشان هو…", "Another take from @netanyahu:\n\n\"Bribery without money is like an omelet without an egg.\"\n\n\"Bribery without money is like Kim without Kanye.\" https://t.co/8XgbmWtkUs", "Israeli youths detained in Palestinian woman’s killing https://t.co/3rGTxt0Wv9", "RT @felschwartz: --&gt; noticeable shift here https://t.co/Rk41iePZLT", "RT @religion_state: via @WSJ Meet 3 men who faced down a taboo and entered the #Israeli military—confronting an issue that has divided the…", "Egypt's tiny Jewish community celebrates state action to protect heritage\n\nhttps://t.co/e52sBpgvSz", "RT @pwonacott: Meet the ultra Orthodox who bucked their community elders to enter the Israeli military. @felschwartz and @DovLieber on Isra…", "RT @HebreWords: A literary Hebrew word for bravery, עוז is also the last name Israeli author Amos Oz took for himself. Oz, who passed away…", "RT @ImageSatIntl: #BREAKING: the #attacked (25 December 2018) site in the #Syrian 4th division camp is completely #destroyed. According to…", "@ltdad613 I guess we'll have to wait and see.", "RT @felschwartz: ---&gt; Follows announcement earlier this year that US would fold the consulate into the new US embassy in Jerusalem. Read mo…", "Netanyahu Bets on Security, Foreign Policy to Win Snap Israeli Election, but Victory No Sure Thing\n\nhttps://t.co/kq2POBUgny", "Israel is going to early elections. At heart, this is due to the fast-growing ultra-Orthodox population in Israel. \n\nRead this article to understand what else is happening around Israel due to its new demographics. https://t.co/RfddqqzJbH", "Israel calls elections for April after Netanyahu’s coalition collapses, complicating Trump’s plan to unveil a map toward peace with the Palestinians https://t.co/UjSuCA5y7Q", "RT @WSJ: “This place used to be crowded on a Saturday night”: A once-bustling Israeli beach town is quieter, reflecting ultra-Orthodox migr…", "Israel asked both France and the US to warn Lebanon: either rein in Hezbollah's missile production, or we'll do it ourselves. w/ @felschwartz\nhttps://t.co/4fzoaP7A3n", "Southern Tel Aviv (Florentine) is so attached to its thousands of dogs, you can by them Sufganiyot -- a jelly donut Jews eat for Hanukkah to remember the miracle of oil in the Temple. \n\nIn Israel, Sufganiyot are an extreme backing sport. https://t.co/LqqtBc0fTi", "RT @GaliGnt: די פלורנטין אין לי כח אליך יותר https://t.co/iXsQSQGq1s", "Israeli Police Recommend Charging Netanyahu With Bribery, Fraud\nhttps://t.co/zvMmyHM2Vy", "Airbnb, Walmart Are Among Latest Brands to Tangle With Politics\n\nhttps://t.co/zXqREmb9pB", "Mr. Netanyahu is now Israel's defense minister, as well as foreign minister and health minister. https://t.co/PWISwCilRX", "Netanyahu’s Coalition in Turmoil as He Rejects Partner’s Demand\n\nhttps://t.co/683EtfQHZ0", "RT @WSJ: Israel could be heading for early elections after Avigdor Lieberman resigned as defense minister and said his party would leave th…", "Israel’s defense minister, Avigdor Lieberman, said he would resign and withdraw his party from the ruling coalition https://t.co/sp2H4DL4eg", "The only person killed in Israel  by current rocket barrage was 48-year-old Mohammed Abu Isbah,  a Palestinian from the Hebron region residing in Israel. \n\nIn contrast to Israeli media reports, he had a permit to both work and reside in Israel. https://t.co/hdIWp4BTJx", "Hopes for Cease-Fire Fade as Gaza Slides Toward War With Israel\n\nhttps://t.co/WD7W6ad2Si", "Israel, Gaza Militants Exchange Heavy Fire After Raid Goes Awry\nhttps://t.co/miSWx5ANAD", "@NeriZilber which channel?", "@NeriZilber Where was this confirmed?", "(5) The result has been a clear lowering of tensions. But In Israel, Netanyahu has come under fire for \"capitulating\" to Hamas. Hamas has claimed victory. In Ramallah, Mahmoud Abbas said this was part of Hamas's plan to prevent the rise of an independent Palestinian state.", "(4) The Qatari money, $15 million, reportedly reached Gaza in three suitcases via Israel. A Qatari envoy to Gaza said payments like this would continue for the next 6 months.", "(3) Israel doesn't want Qatari money reaching the hands of Hamas's military wing. But it seems for the 1st time Israel accepted Qatari money reaching Hamas's civilian employees.", "(2) W/ Israeli coordination, Qatar has been putting millions into Gaza for years now, building neighborhoods &amp; paying for fuel.\n\nSo what's new? That Qatari money went right into the hands of Hamas employees.", "(1) *Thread on this:\n\nMisery Relents in Gaza Amid Israel-Hamas Truce Talks\n\nhttps://t.co/umxSpGl55m", "(4) There are still many Palestinians who oppose this new cooperation. W/O a political agreement, they argue it entrenches Israel's power over the Palestinians. W/ some major exceptions (e.g. Rawabi), much of this cooperation is still done quietly.", "(3) Many see the wisdom in outsourcing those jobs to Palestinians instead. It's cheaper, closer to home, and helps bring prosperity for Palestinians, which they argue in turn brings security for Israelis.", "(2) Israel outsources around 20,000 tech jobs to E. Europe &amp; India per year. About a billion dollars worth. There just isn't enough local talent to fill the demand for Israel's vivacious tech scene.", "(1) *Tweet thread\n\nDesperate for Tech Talent, Israel Turns to an Untapped Labor Pool: Palestinians\n\nhttps://t.co/tQtIgeKUB8", "Did you know: Pigeon keepers were banned in Raqqa when ISIS controlled the city. Now they're back to the roof tops &amp; residents of the city aren't happy.\n\nGreat article by @RajaAbdulrahim \n\nhttps://t.co/rxfY1uBwta https://t.co/YgMpVtiXQS", "RT @JoshNBCNews: .@felschwartz connects the dots in recent flurry of Israeli diplomacy with Gulf Arab states, which do not formally recogni…", "Israel seems to be making gains in efforts to make relations w/ Gulf states public. \n- Bibi visits Oman\n- 3 Israeli ministers have visited or will visit Gulf states openly soon.\n- Below in vid: Israeli minister visits Sheikh Zayed Mosque in Abu Dhabi\nhttps://t.co/b9syOzkINu https://t.co/N7pCCfKZDb", "@michaelh992 @felschwartz It's important because people were saying no Israeli strikes due to fear of s300", "US military officials fear the perception that the US gives Israel intelligence in Syria will prompt Iranians or Iranian backed groups in Iraq or Syria to attack US soldiers there.", "@felschwartz Another interesting tidbit from the story:\n\n\"Russia has deployed its S-300 system in Syria but it isn’t yet operational, a security official said.\"", "Interesting scoop from @felschwartz:\n\n- US military officials say they fear Israel's air campaign in Syria could prompt Iran to strike US troops in M.E.\n\n- Pentagon is at odds with White House, which is in lockstep w/ Israelis about Syria\n\nhttps://t.co/lONomdUo81", "My heart breaks for those killed in the pittsburgh shooting. יהיו זכרונם לברכה", "RT @WSJ: Guitar maker Fender says 50% of beginner players are women https://t.co/VPVKWm2mdi", "--&gt; Did you know: Saudi Arabia is now the largest single investor for U.S. startups. \n\n--&gt; MBS put at least $11 billion of Saudi money into U.S. startups since mid-2016\n\nhttps://t.co/a5dtc5Rdks", "RT @pwonacott: Saudi Arabia has binged on debt. Now after the #jamalkhashoggi disappearance, investors are worried.  https://t.co/xfINkTWMg…", "RT @pwonacott: Crown prince sought to lure Khashoggi back to Saudi Arabia and detain him, U.S. intercepts show. @shaneharris on an importan…", "Manhunt begins for Palestinian gunman who killed two Israelis as tensions mount https://t.co/W7RZGWiiT8", "RT @afekki: “To me, this is a clearance toward harassers that they can freely harass women,” said Mohamed Lotfy, Ms. Fathy’s husband.\n http…", "@ykilstein Thanks for the question Yaakov. Hamas, in its official statements, media and from the mosques it controls have called specifically for Gazans to go protest.", "RT @WSJ: U.S. to remove missile systems from the Middle East as the military steps up its focus on threats from China and Russia https://t.…", "RT @SuneEngel: The Iranian currency has hit another historic low today: 180,000 to the USD. In January, it was 45,000. Only a week ago, 145…", "צום קל וחתימה טובה", "שנה טובה ומתוקה", "Mind-boggling stuff here: https://t.co/fi3uG3L21g", "RT @pwonacott: Israel’s diplomatic outreach has entailed courting the world’s populist authoritarians. ⁦@felschwartz⁩ ⁦@DovLieber⁩  https:/…", "This may spur discussion on what self-described pragmatists see as the only viable solution to the Israeli-Palestinian conflict -- a federation. https://t.co/oJFkOKu6Hi", "RT @Franke_schrijft: yeah so I know Israel is a global powerhouse in cyber security and all but let's talk brick and mortar... When I need…", "The New Lobbying: Qatar Targeted 250 Trump ‘Influencers’ to Change U.S. Policy\n\nhttps://t.co/HcspS6KSj9", "Haha https://t.co/gMv3T5vUh8", "Israeli schools largely avoid teaching evolution — report\n\nIsrael's education minister heads a religious party. \n\nhttps://t.co/E60lbsnQtF", "RT @SuleimanMas1: تقرير @gilicohen10 اسرائيل ستقوم بعرض برنامج متكامل لتحسين الوضع الانساني في غزة ويشمل:\n1) اقامة منطقة صناعية في معبر كار…", "RT @SuneEngel: ISIS is losing ground but continues to reign supreme among terrorists in cyber space. As its caliphate crumbles, its online…", "The memorial has a Hebrew inscription:\n“Here your eyes sparkled when I asked for you hand.\nAnd now, all I have left is the sparkle of your star.” https://t.co/H4pcIqszjg", "Found heartbreaking memorial on the shore of the Sea of Galilee. \n\nIt was the site of a wedding proposal. The girl died a month later, crushed to death in a traffic accident in Spain.  The back-half of the stone is a two-seater bench, for lovers to share the view. https://t.co/r8QwEmOyUU", "RT @james_lavino: This is amazing. I wrote this letter. https://t.co/iN1BbIvLim", "Spotted in Tiberias: transliteration of Hebrew prayer book to Marathi https://t.co/E8m2S4jEOy", "RT @felschwartz: “If the school closes, how will we acquire knowledge?,” a 13yo girl in Gaza told me. “We won’t be able to fulfill our drea…", "Looks like Israel and Hamas are heading to some sort of long-term ceasefire, brokered by Egypt and the UN. \n\nIt's hard to see though, unless a prisoner swap is concluded &amp; the PA is included, what kind of legs any truce would have. https://t.co/qwTVyMByH4", "Israel reopens Gaza’s only commercial crossing amid fragile calm  https://t.co/mVl0fHZwaU", "--Both Israel and Hamas are again signaling they don't want this to escalate into war. \n\n-- A senior Israeli official: \"If [Hamas] will send us flowers, we will send them candies...Let's hope for peace and be ready for war\"\n\nhttps://t.co/lgGayjbzWZ", "RT @felschwartz: Israel says it killed 7 suspected Islamic State militants in the Golan Heights https://t.co/0nDPDRCi6S", "RT @felschwartz: “The state of Israel respects our dead, but not our living,” said Naser Saba, 40, from a Druze village of 10,500 in the hi…", "RT @adamrasgon1: “We are not telling anyone to become Israeli, change their religion, give up the Al-Aqsa Mosque or join the Israeli army..…", "As Israel Enshrines Its Jewish Identity, Its Druze Minority Feels Abandoned\n\nw/ @felschwartz https://t.co/k74lQy6s5n", "“The state of Israel respects our dead, but not our living,” said Naser Saba. \n\nSaba, a tour guide, said he once visited the Dachau concentration camp in Germany, and walked barefoot in the winter just so he could understand the suffering of Jews in the Holocaust. https://t.co/EXsOr6wfCQ", "As Israel Enshrines Its Jewish Identity, Its Druze Minority Feels Abandoned\n\nhttps://t.co/y0womEvRaI", "RT @leloveluck: Excellent reporting by ⁦@SuneEngel⁩ on how the return of Syria’s refugees became a bargaining chip - and the very real and…", "Is that a threat, @TheTweetOfGod ? https://t.co/4pJGAQappg", "I've been devouring @harukimurakami_ lately. I searched Youtube for an interview. \n\n1st thing I found is his 2009 speech in Israel, defying  boycott &amp; speaking from his heart to Israelis. \n\nhttps://t.co/Jf8SUjvHU2", "RT @michaelkamon: Important talks happening. Go deeper with @felschwartz and @DovLieber https://t.co/lROn8UeAvj https://t.co/XhVK7HsxkI", "Both the UN and Egypt are making serious efforts to end the cycle of violence between Israel and the #Gaza Strip. \n\nThis includes efforts to finally end 11 years of a Palestinian political division between Gaza and the West Bank https://t.co/7Z88YBvV9n", "RT @felschwartz: Read me and @DovLieber on the intra-Palestinian feud that threatens long-term relief in Gaza https://t.co/87FSRSvDzl", "Montoya Circle, where I grew up in Boca Raton, Florida -- where there is a predominately Orthodox Jewish community. https://t.co/Mi2h9NRl3A", "‘We Need Bread and Butter’; Iranians Under Pressure in Flailing Economy\n\nhttps://t.co/cQsgx2bXtf", "RT @RaoulWootliff: Cartoonist Avi Katz has reportedly been fired by the @Jerusalem_Post over his cartoon yesterday depicting Likud MK and @…", "Israel shoots down Syrian jet fighter. The warplane crossed 2 km into Israeli airspace before being downed, the IDF said.  https://t.co/UnHCp3psg9", "RT @RaoulWootliff: Wow. Cutting satire from the cartoon page of the @Jerusalem_Post's Jerusalem Report, playing on the photo of @netanyahu…", "@diaahadid I like Jane, but I’m talking about family matters", "Agreed! Well-done @diaahadid . I can personally sympathize with at least some of the sentiment expressed. https://t.co/7raXkWih2b", "A group of palm trees planted in Tel Aviv beach for a soldier killed four years ago in the last Gaza war, known as Operation Protective Edge. https://t.co/yhszpNqXV3", "Kafka is crying somewhere https://t.co/TeWv7Qbhee", "Israel Passes Contested Law That Defines It as a ‘Jewish State’\n\nhttps://t.co/U4p0aXm8EX", "RT @michaelh992: Below are some thoughts on the WSJ new info on #Iran's land corridor, published in this article \nhttps://t.co/sqdKZjmUWI h…", "RT @AmichaiStein1: ה-@WSJ מפרסם: כך נראה נתיב העברת הציוד והנשק היבשתי בין איראן לסוריה, שישראל תקפה את אחד מבסיסי המעבר בגבול סוריה/עיראק…", "New Details Emerge on Unprecedented 'Israeli Strike' on Syria-Iraq Border\nhttps://t.co/FtoAwYX5cy"]