["RT @SethAbramson: If you're not watching this right now, you're missing out. This is something else.\n\nPlease RETWEET this major live event…", "RT @robreiner: Children caged in filth, moronically tearing up Iran deal to possibly plunge US into war, another woman sexually assaulted,…", "RT @nowthisnews: BREAKING: Writer E. Jean Carroll says Donald Trump violently sexually assaulted her in a department store dressing room in…", "RT @RepTedDeutch: We can’t get interviews. \n\nWe can’t get Mueller’s files or unredacted report. We can’t hold hearings with material witnes…", "RT @RogueNASA: Imagine being this horrible. https://t.co/jR8JXa1etx", "RT @Amy_Siskind: It’s how far down the rabbit hole we are already that a woman comes out and makes credible allegations of rape against a s…", "RT @Zac_Petkanas: The President nearly started a war with Iran and was accused of rape. \n\nThat was the last 24 hours.", "RT @ForeverLogical: @cmclymer I don't hear anyone telling the male victims of sexual assault from Catholic Priests that they should have sp…", "RT @cmclymer: People criticizing E. Jean Carroll for processing her rape on her own time can go to hell. As if all of us didn't watch Brett…", "RT @brianklaas: If your boss told you that you needed to stand in front of a federal judge and argue that it was permissible to deny little…", "RT @SallyQYates: Our country is forcing young migrant children, separated from their parents, sometimes sick and always frightened, to slee…", "RT @RogueNASA: Not all Concentration Camps have gas chambers.\n\nAnd if that's what you're waiting for before you get outraged, you might wan…", "RT @RBReich: How do these people sleep at night? \nhttps://t.co/ZS7DTegCI3", "RT @SethAbramson: I think a new allegation of *forcible rape* against the President of the United States should be breaking news on, um, *e…", "RT @SethAbramson: SOURCE/ I'm not sure why NEW YORK MAGAZINE changed the title of this piece from what it *apparently* first was (see web a…", "EVERYONE in AMERICA should see this video #NoOneIsAboveTheLaw https://t.co/3pyaSWoqxn", "RT @HouseJudiciary: There should be broad consensus that if a political candidate accepts help from a foreign nation—and even welcomes this…", "RT @tribelaw: .@gtconway3d is right. @SpeakerPelosi is wrong. It’s not even close. And I’m a lifelong Pelosi fan. https://t.co/Woa85w7XK8", "RT @SethAbramson: No one was ever held accountable for lying America into a war in Iraq. So why *wouldn't* the same party, indeed even some…", "RT @thegoodgodabove: Dear Americans,\n\nThere are mothers and their children being held in military concentration camps in your country. No o…", "RT @SethAbramson: Trump just told us he'd try to steal the 2020 election by getting assistance from other countries, including hacked mater…", "RT @Comey: Happy #PrideMonth everybody https://t.co/JcozD73nZZ", "RT @SarahKSilverman: Watch thru the end. I am so proud to be alive to see @AOC kick ass and change the world https://t.co/WIYdbY2yLg", "RT @RogueNASA: No words. https://t.co/mlvQ7f1TJP", "RT @SethAbramson: This is a call a criminal defense attorney makes if he has a guilty client. 100%. https://t.co/yoeGqe0QAM", "RT @TeaPainUSA: 'bout dang time!\n\nhttps://t.co/eIFDdDUDeq", "RT @SethAbramson: As far as I'm concerned, Trump is deporting Americans. And that's exactly as historically sinister a scheme as it sounds…", "RT @RogueNASA: Props to everyone supporting the Straight Pride Parade\n\nWe know it was tough for you coming out to your parents, getting kic…", "RT @RBReich: The next time you hear Trump and his enablers claim that \"other countries\" are going to pay for his tariffs, know the truth. O…", "RT @brianklaas: Trump can do as many photo ops in white tie as he wants. But he is savaging our key alliances.\n\nChange in confidence in US…", "RT @AshaRangappa_: Ask and you shall receive. @SpeakerPelosi says that we can’t impeach because enough Americans don’t understand how the p…", "RT @SethAbramson: (THREAD) BREAKING: The NYT just published the biggest political news since the Mueller Report was published: we now know…", "Meet the new Himler 2.0\nNew York Magazine: In Terrifying Interview, William Barr Goes Full MAGA.\nhttps://t.co/7ZpuvuYPAR\n\nvia @GoogleNews", "Precisely. They already lost me for this very reason. https://t.co/uK3r94RwgO", "RT @SethAbramson: (PS) I'd bet anyone reading this that there has never in the history of the United States been a case where federal prose…", "RT @SethAbramson: (2 of 2) That is, the reason the judge issued an unusual order about releasing certain Flynn materials is that he wants A…", "RT @SethAbramson: What you should take from the executive branch of our government openly defying the judicial branch today over Flynn: Fly…", "RT @tribelaw: In Trump’s and Barr’s America, it looks like the Executive Branch has finally claimed it can defy not only the Legislative Br…", "RT @PuestoLoco: @tribelaw @JRubinBlogger The important part is what are Dems in the House going to do about it? They're coming across as le…", "RT @joshscampbell: Trump Finally Admits Russia Helped Elect Him\n\nhttps://t.co/9c0NIkIqtb", "He DID report it! He outright said that he found 80 pages worth of obstruction but was not allowed to indict him due to the DOJ rules and said that Congress needs to do it! Do you not speak or read English? https://t.co/Wr5SENFlBh", "I am! https://t.co/LDgXlJ0xMY", "RT @PuestoLoco: @TeaPainUSA The House derives its impeachment powers directly from the Constitution. Thus, the courts have no jurisdiction.…", "RT @TeaPainUSA: Trump’s in a white-hot panic this mornin’. He just admitted that “Russia helped him win the election.”\n\nIs Trump foreshadow…", "@realDonaldTrump So you admit that Russia got you elected yet you refuse to do anything about it!", "RT @tribelaw: There are now over 1,000 prior federal prosecutors of both parties who attest that the evidence in the Mueller report would’v…", "RT @PuestoLoco: @realDonaldTrump @FoxNews Except when your campaign Mgr. Manafort gave inside polling data over several months to indicted…", "@SpeakerPelosi he is playing you like a fiddle. You don't need proof of obstruction, his witness interference when it comes to subpoenas is proof enough https://t.co/YaZ6YK2SUw", "Exactly! https://t.co/tZydDSVGTg", "Same here. Trump is going to win regardless of who we vote for because he is doing nothing to stop Russia from rigging and stealing the election again. Our republic is dead. https://t.co/SftJSjvFEj", "RT @emptywheel: Shorter Mueller: That was an impeachment referral, damnit, now act on it.", "RT @KamalaHarris: What Robert Mueller basically did was return an impeachment referral. Now it is up to Congress to hold this president acc…", "@HouseJudiciary Tell that to Nancy. She doesn't seem to have gotten the memo.", "RT @RWPUSA: Mueller to Pelosi: impeach.\n\nAmerican voters to Pelosi: impeach or resign.", "RT @eugenegu: Robert Mueller literally says Russian intelligence hacked Hillary Clinton’s emails to influence our election and when he trie…", "RT @TeaPainUSA: \"If we had confidence that the President clearly did not commit a crime, we would have said so.\" - Robert Mueller\n\nDOJ-spea…", "@WhiteHouse Propaganda bullshit. The report clearly shows collusion, conspiracy, and obstruction. Mueller made clear today that he simply wasn't allowed to indict Trump because Barr said so. You're all a bunch of crooked liars.", "@tedlieu @realDonaldTrump @TheJusticeDept I'll believe it when I see it. Congress is doing nothing to impeach. I have voted regularly ever since I turned 18. I'm 46 now. At this point I'm so disenfranchised with all of government that I don't even want to bother voting anymore. What's the use? Gov is completely broken.", "@WhiteHouse Yeah and those Americans polled must not have read the economic reports showing that we are slipping into a recession.", "RT @LordSnow: Kit Harington’s reaction to learning Jon kills Daenerys #TheLastWatch https://t.co/NeF3isGMsT", "RT @AOC: What gets me is news breaks that this woman is weighing committing a crime before Congress &amp;it’s getting framed by the NYT as some…", "RT @RepAdamSchiff: Indeed it is. The signal is this: If I flatter Trump and criticize his opponents, I can launch missiles and advance my n…", "RT @Lady_Star_Gem: Say their names\n\nMariee Juárez—19 m/o\nWilmer Josue Ramirez—2.5 y/o\nJakelin Caal—7 y/o\nFelipe Gomez Alonzo—8 y/o\nCarlos H…", "@realDonaldTrump @WhiteHouse What an insulting picture", "The Daily Beast: You Think It's Bad Now? Wait for Next Year's Show Trials. #MemorialDay #Democracy\nhttps://t.co/jHSb4Gxan4\n\nvia @GoogleNews", "RT @tedlieu: Oh that's interesting @GOPLeader. Did y'all read Article I of the Constitution? #GOP is silent or cheering on the following ac…", "Every day this dictator pushes our system of checks and balances into the gutter and does whatever he wants. Congress just stands by and lets him, which is just as bad. Our republic is dead. Our Government killed it. No one is upholding the constitution anymore. https://t.co/CUNEvjK57Q", "RT @Pappiness: The House voted 247 to 175 to end military assistance to Saudi Arabia.\n\nThe Senate voted 54 to 46 to end military assistance…", "RT @michaelkruse: We're not prepared for how bad stuff's gonna get. https://t.co/mzuavEcL8M", "RT @tribelaw: The House Intelligence Committee under @RepAdamSchiff needs to investigate whether this circumvention of Congress is driven b…", "RT @gtconway3d: “I don’t do cover-ups.” https://t.co/lhG8Kssmrt", "@WhiteHouse What is this divisive propaganda bullshit?!? Only (guilty) dictators do this sort of thing. I do believe that thou doth protest too much!", "RT @JoeBiden: Over the last year, six children have tragically died in US custody at the border. It’s unacceptable. It’s not who we are. An…", "RT @Daenerys: Game of Thrones will be missed! https://t.co/ppDEjixbxf", "RT @USMCLiberal: Ummmm— Trump just admitted to knowing about the #TrumpTowerMeeting.\n\nHe said, “he called me, and he had the meeting after.…", "RT @morningmika: #weDeserveToKnow Please spread the word AND DEMAND ANSWERS.  AND IF YOU WORK FOR THIS PRESIDENT,THIS IS ON YOU. PLEASE STE…", "RT @tribelaw: Beam this out from the rooftops or it’ll be like the sound a tree makes when it falls in a forest — out of everyone’s earshot…", "This is epic! https://t.co/MEBJMzZIy4", "Unfortunately it was probably our tax dollars that paid for this nonsense https://t.co/EHeqQ5rfDl", "RT @AngrierWHStaff: 👀 https://t.co/Gn7mGzj1L3", "RT @grantstern: “The want to impeach me,” says President #TrumpTantrum https://t.co/zUWzG70zvJ", "RT @TrueFactsStated: Oooh! ⁦@tedlieu⁩ isn’t playing. #dissBarr https://t.co/eBIA7esrRq", "RT @mommamia1217: 😡😡😡😡😡😡😡😡Well, well, well. The Trump administration has pushed back Harriet Tubman’s $20 bill till 2028.\n😡😡😡😡😡😡😡😡\nAre you…", "RT @TeaPainUSA: Trump just announced \"there will be no infrastructure bill until the House ends its phony investigations.\"\n\nIf you think Tr…", "RT @TeaPainUSA: Let. This. Sink. In. \n\nDonald Trump says America will get no infrastructure spending, or any other legislation for that mat…", "RT @AngrierWHStaff: This is Pelosi edging her way towards impeachment. \n\nThe committee chairs are almost unanimous on the issue now — it’s…", "@CheriJacobus With this do-nothing Congress I'm believing that less and less. The dems won this last election because Americans hoped they'd do something about Trump but here they are with a lot of talk but too scared to act", "RT @RBReich: We cannot become inured to this authoritarian behavior. Dictators and despots use this kind of rhetoric to suppress opposition…", "RT @robreiner: The corruption in the Trump WH is so overwhelming that sanctions lifted on Putin Oligarch for an aluminum plant in Kentucky…", "We already have enough to #ImpeachTrumpNow", "I agree w/this 110%! By investigating more they're just playing into Trump's storyline to his followers that  Mueller report showed nothing so dems are investigating cuz they're just out to get him. They're just backing his story #AfraidToImpeach https://t.co/4Z4zKFg5M5", "RT @EdwardTHardy: Richard Nixon's Attorney General John Mitchell spent 19 months in prison for doing what Donald Trump's Attorney General W…", "RT @ForeverLogical: @WhiteHouse Trump told his supporters he'll possibly serve 5 presidential terms at last night’s rally https://t.co/fzlS…", "Given our examples it looks like we are all allowed to ignore subpoenas now. Either that or our entire government is above the law. It's gotta be one or the other so which is it? https://t.co/V9aUBpmjnz", "RT @mmpadellan: Swear to God, today is just one of those days I feel like throwing up my goddamn hands and quitting.\n\nThe inability of lead…", "RT @AOC: It is just as politicized a maneuver to not impeach in the face of overwhelming evidence as it is to impeach w/o cause.\n\nCongress…", "RT @RoguePOTUSStaff: Many Democrats in the House now bear the shame of being against impeachment, simply for political expediency, even whi…", "RT @Woman_on_Pause: @CraigJCG @ThePlumLineGS @CheriJacobus @RepJeffries So much so, I have decided until action is taken, they are complici…", "This is pretty much where I'm at right now https://t.co/HEZEYRYEf2", "Precisely! I absolutely will NOT vote for a single dem who has pushed against impeachment and/ continues to! https://t.co/h8YUcBxQrN", "RT @mkraju: Pressure grows on Pelosi as more Dems say it's time to begin impeachment inquiry.  Schiff, who has been skeptical, says  \"case…", "RT @JuddLegum: Hard to understand why the House Democratic leadership also does not adopt this view: Impeachment is about the principle of…", "RT @RashidaTlaib: The drum is beating and it is getting louder. The future of our democracy depends on us putting country first. #TimetoImp…", "RT @RepJayapal: We are now at the point where we must begin an impeachment inquiry. I don't say that lightly. We've taken every step we can…", "RT @Mimirocah1: Every single @SenateGOP @HouseGOP member who appears on TV to defend  Trump should be asked if they’ve read the full Muelle…", "RT @wvjoe911: Barr admits he took the AG job because Trump was being ‘hurt’ https://t.co/3LPP14zegA", "RT @robreiner: Trump hasn’t read The Mueller Report. But he’s been told what’s in it. And he’s afraid. It contains the most damning evidenc…", "RT @csd: @CheriJacobus Dems: *Issue subpoena*\n\nTrump: “Ignore it”\n\nGOP: “Ok boss”\n\nDems: *Issue strongly worded letter*\n\nGOP: *Kicks Dems i…", "@SpeakerPelosi #ImpeachmentInquiryNow #ImpeachmentHearingsNow #Impeachment #ImpeachmentHearings #ImpeachTrump #ImpeachTrumpNow #Congress", "RT @kylegriffin1: Jerry Nadler: \"The president took it upon himself to intimidate a witness who has a legal obligation to be here today. Th…", "RT @djrothkopf: Some Dem leaders who put politics before principle or Constitutional responsibility on the issue of impeachment do not seem…", "RT @RyanDEnos: We become used to this, but listen to what he says - it should be terrifying. It is the language of 1930's Fascists: \"treaso…", "I Agree! https://t.co/A6dgqCgSEy", "@CAPAction @grantstern @RepJerryNadler More talk. Wish they would actually walk the walk. I've lost all faith in gov as a whole", "RT @waltshaub: I'd like to hear Trump's congressional allies declare what, if anything, would be a red line they won't let Trump cross. Dep…", "RT @RepMGS: No one is above law. It's time to start an impeachment inquiry. Having the courage to think about the long-term consequences of…", "RT @WhitfordBradley: You know what’s really politically inconvenient?  The end of democracy. #Impeach", "Too bad they still remain complicit while thinking it https://t.co/IUaWmTkh3W", "RT @PreetBharara: So you’re a House Dem. You’re not sure impeachment is electorally smart but you ARE sure impeachment is constitutionally…", "RT @NormOrnstein: McGahn is a private citizen. It is time for the House to step up and defend its own integrity. Send the Sergeant at Arms…", "RT @brhodes: The most disastrous and unnecessary American wars tend to begin with a really big lie that they’re defensive instead of offens…", "RT @kurteichenwald: 1. From Mueller's start, I said thered be no proof of collusion by Trump. My case: He's too stupid to orchestrate somet…", "RT @SethAbramson: In a country with a KING, the KING decides when the country has \"had enough\" of something. In a country with RULE OF LAW,…", "RT @tribelaw: The serious felonies Trump seems to be orchestrating against McGahn and his firm are codified in 18 U.S. Code § 1513, which c…", "RT @TeaPainUSA: Crisis, meet Constitutional.  The Trump hijacked DOJ has declared anyone it chooses has the right to ignore Congressional s…", "RT @ChrisMurphyCT: I'm listening to Republicans twist the Iran intel to make it sound like Iran is taking unprovoked, offensive measures ag…", "RT @SethAbramson: It's settled law in DC federal court that there's no unqualified immunity for a former White House Counsel. Don McGahn do…", "Sounds like typical rules of a dictatorship https://t.co/6PGWwPlP7i", "RT @neeratanden: Just a reminder for all reporters: Trump’s daughter has a stash of Chinese licenses.  She’s doing business in China Right…", "RT @tribelaw: When will some Democrats in the House leadership show as much courage and good sense as Tea Party Republican @justinamash has…", "We will remember how Congress let fear of losing an election \"trump\" their constitutional obligations. We will remember how Congress let democracy die and allowed a dictator to take over America.", "We will remember how Congress stood by and let it happen when they could have stopped it. We will remember how Congress was more concerned about party over the constitution and the people.", "Keep talking and waiting and doing nothing to move forward with impeachment and we will lose thousands of our fathers, sons, uncles, brothers, mothers, sisters, daughters, friends, and other family members to a mindless war with Iran. When that happens Americans will remember", "Children in concentration camps? Dangerous gas-lighting attempts? Threats to stay in office beyond his term? Propaganda attempts to discredit our laws, law makers, and law enforcers? Blatant disregards to the constitutional power afforded to Congress?", "(THREAD)I've lost all faith in our government. They just keep talking but no one is doing anything about this criminal in the whitehouse. How many more immigrant children deaths are you waiting for? How many more stacked courts? International embarrassments? Trade war fallouts? https://t.co/GVuxU2EdIg", "RT @MalcolmNance: WARNING: “a suggestion to recruit African-Americans and transport them to camps in Africa “for combat prep and training i…", "RT @SethAbramson: THE PRESIDENT OF THE UNITED STATES, per his ATTORNEY: https://t.co/nBPP6tk5JY", "RT @justinamash: Here are my principal conclusions:\n1. Attorney General Barr has deliberately misrepresented Mueller’s report.\n2. President…", "RT @justinamash: We’ve witnessed members of Congress from both parties shift their views 180 degrees—on the importance of character, on the…", "RT @justinamash: Our system of checks and balances relies on each branch’s jealously guarding its powers and upholding its duties under our…", "RT @tribelaw: \"It is ... not fathomable that a Constitution that grants Congress the power to remove a President for reasons including crim…", "RT @harrylitman: Quite a salvo this afternoon:  1) Trump directs McGahn not to testify, based on opin citing no precedent; 2) court rejects…", "RT @tribelaw: .@SpeakerPelosi is a master politician but needs to recognize that it’s finally time to begin an #ImpeachmentInquiryNow into…", "RT @kylegriffin1: Judge Mehta, Page 24: \"It is simply not fathomable that a Constitution that grants Congress the power to remove a Preside…", "RT @RBReich: Members of the Trump admin. who have used personal email to conduct official business: \n1) Ivanka Trump \n2) Jared Kushner \n3)…", "RT @RubenGallego: I get the same intel as Cotton.  He is greatly exaggerating the situation to spur us to war. Don’t fall for it. https://t…", "RT @SethAbramson: MAJOR BREAKING NEWS in NEW YORK TIMES (5/19): Deutsche Bank Flagged Suspicious Payments From Jared Kushner to Multiple Ru…", "Exactly! Not even trying sends us the message that they don't care that we have a criminal &amp; tyrant in office who's destroying our country, violating the constitution, and turning our gov into a dictatorship. It sends the msg to future politicians that they can get away w/it, too https://t.co/9ECAdK7kiC", "RT @Comey: The president claiming the FBI’s investigation was “TREASON“ reminds me that a Russian once said, “A lie told often enough becom…", "RT @Comey: The AG should stop sliming his own Department.  If there are bad facts, show us, or search for them professionally and then tell…", "@realDonaldTrump Um, you were told by several people but I guess since you only pay attention when it's the sound of your own voice it would explain why you don't remember", "RT @SethAbramson: Understand that the reason Trump is saying he knew nothing about Flynn's problems is because the evidence suggests that n…", "@realDonaldTrump You are balls deep in the swamp and we are still waiting for you to drain it but you just keep reeling them in", "RT @SethAbramson: 1/ In terms of saving America from lawlessness and the destruction of our democracy, we must now accept that not only is…", "RT @SethAbramson: This is the situation America is faced with—and must contend with—going forward: America only works if we have rule of la…", "RT @thegoodgodabove: Thou shalt not pass laws for body parts you don’t have.", "RT @tedlieu: This speaks for itself. https://t.co/APFFXJ3fmP", "RT @kyledcheney: JUST IN: MUELLER team unseals evidence that Flynn aided the obstruction invsetigation -- including providing testimony and…", "RT @aliasvaughn: 1. I'm trying to digest the news quickly bc I've been away all day AND I just came back to MAJOR developments but essentia…", "RT @RBReich: So let me get this straight: It’s a crime for a woman to make decisions about her own body, but it’s not a crime to collude wi…", "@SethAbramson They're afraid that impeachment will effect their 2020 election chances. Have they considered that not impeaching will effect it? 'Cause I sure as hell won't vote for a single dem or rep who DIDN'T push for impeachment!", "We've moved into an authoritarian/dictatorship gov. Executive branch is continously abusing its power &amp; refuses to subject itself to checks &amp; balances our forefathers built into our gov to prevent this very thing from happening. They didn't bank on Congress allowing it to happen.", "RT @CheriJacobus: WATCH: Trump's 2020 Campaign Banners are Being Made in China https://t.co/5ASFRnqKh1 via @usatoday", "RT @Daenerys: Dracarys! 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥…", "RT @jestertrog: The face of all the parents that named their kid Daenerys, Dany, or Khaleesi #GameofThrones https://t.co/3MOTy0ZFIJ", "RT @coolvikkyz: Rt if you are safe from DRACARYS at KING'S LANDING!! #GameofThrones https://t.co/gPpAyJQt5p", "RT @emilykayfisher: This right here folks, is when Jon snow realized he actually knew nothing #GameofThrones https://t.co/9WkR9OCl0I", "RT @fishimoon: Watching Daenerys burn The Iron Fleet | Watching Daenerys burn all of Kings Landing after they surrendered😩 #GameOfThrones h…", "RT @16695_atl: #GameOfThrones  \n\nwell shit.... https://t.co/iCOJd0rToZ", "Daenerys!😭😭😭 #GameOfThrones https://t.co/8Ko4nLrdLI", "RT @omxribrahim: Twitter took the words straight of my mouth. \n\n #GamefThrones https://t.co/5ufIpEjrNF", "RT @TalbertSwan: You don’t get to spend 8 yrs telling Obama to “go back 2 Kenya,“ calling his wife a “gorilla in heels,“ disrespecting his…", "RT @tribelaw: I’m losing patience with the definitional obsession over whether we’re in a “constitutional crisis.” It’s like when your kids…", "RT @RBReich: We are in a Constitutional crisis. What to do? \n\nThere are many practical political reasons not to impeach Trump. The House mu…", "RT @tkaz99: @RBReich #ImpeachTrump https://t.co/DbQRR9LaC8", "RT @AOC: Going from waitressing a year ago to now carries a LOT of life-adjustments.\n\nBut 3 paychecks in has shown me how 1 of the greatest…", "@tedcruz @DonaldJTrumpJr Kushner literally drew up a contract with a Russian oligarch tied to Putin to get rid of sanctions in exchange for help winning the election while Obama was the sitting president! How is that no collusion??? It's downright treasonous conspiracy!", "RT @aliasvaughn: Adam Schiff Introduces Constitutional Amendment To Overturn Citizens United\n\nvia @highbrow_nobrow \n\nhttps://t.co/1Nj47Gr0vZ", "RT @grantstern: Congress must deploy their inherent contempt powers against AG Bill Barr immediately.\n\nFines, imprisonment, compulsion to t…", "RT @TeaPainUSA: Impeachment support rises 5 points to 45%.  (Higher than Trump's approval %)\n\nTwo weeks of public hearings and this number…", "RT @adamcbest: Conservatives on abortion: We want a ban!\n\nConservatives on gay marriage: We want a ban!\n\nConservatives on immigration: We w…", "RT @SethAbramson: Great—arrest him. That's what happens in America when you ignore a subpoena. A warrant gets issued for you to be taken in…", "@tribelaw He has been talking about remaining in office beyond his term on the campaign trail ever since he was installed  in office", "RT @TeaPainUSA: The House needs to excercise it’s full CONSTITUTIONAL power and let  William Barr and Steve Mnuchin contemplate their decis…", "RT @SenKamalaHarris: The president all but confirmed today that he improperly asked the DOJ to prosecute John Kerry.\n\nI'm now demanding tha…", "RT @tribelaw: Trump is sending Giuliani to Ukraine to get its government to help Trump win reelection by hurting Joe Biden’s family. Read t…", "Precisely https://t.co/8XsQIPMw4n", "RT @TeaPainUSA: Trump keeps claimin' the Mueller Report \"exonerated my son.\"\n\nFUN FACT: The Mueller Report \"exonerated\" no one.", "@krassenstein If this had been Obama or Hillary they would have already held impeachment hearings", "@krassenstein It doesn't matter if only 1 American wants impeachment. That's not how this works! He committed impeachable offenses. Period. Impeachment is not defined as doing so because people don't like the president. It's defined as doing so because the president violated his office", "@krassenstein Meuller was not legally allowed to indict or accuse but he did so in the vocabulary that he so eloquently chose", "@krassenstein Also, because not impeaching him is remaining complicit, throwing the constitution out, and not working for the American people like they were elected to do", "@krassenstein Yes because he has committed crimes and impeachable offenses...and that's just in the last few days in ordering people to violate congressional subpoenas!", "RT @TravisAllen02: The only thing easier to buy in America than a gun is a Republican.", "RT @KenDilanianNBC: The president of the United States just doubled down on his contention that it is perfectly OK to accept opposition res…", "RT @Acosta: Trump keeps claiming, and did so today, that Puerto Rico received $91 billion in disaster relief funds. This is not true. It sh…", "@tribelaw I'm beginning to doubt that because our congress has no backbone to impeach any of these treasonous bastards", "If we remain complicit as a country then we no longer believe in or serve the constitution. It's the same as saying that it's ok to conspire with a foreign adversary, to obstruct justice, and to abuse power &amp; stomp all over our checks and balances gov and rule as dictator https://t.co/E8ZkPsRLvo"]