["The fact that a Buffalo writer is dumping on a Habs player isn’t lost on me.", "@CoffeeKristin https://t.co/jyojKvT9ed", "I did not need this https://t.co/KRKiyoMieZ", "RT @ChronJacob: Many factors play into differences in raises offered by districts, but the biggest one is they're not all receiving the sam…", "@OwenNewkirk Good to see Kari in there", "@CraigJButton @HockeyHallFame @DallasStars Thank you, Craig! Now to get #26 in there!", "@SportsSturm hello!!! Jere!!! #26", "@ThomasCindi ZUBIE!!!! GUY!!!! Girl, I’m missing you extra hard today💚💚💚💚💚💚💚💚🍹🍹🍹🍹", "RT @travcurrie: Today's the day\n\nSergei Zubov - One of the most underrated and overlooked players of all-time. Absolutely zero legit reason…", "@DallasStars @HockeyHallFame About freaking time! Zubov and his cigarettes in the HOF", "I’m freaking bawling!!!! It’s about time!!!! https://t.co/WhLyrOJlE4", "CARBO!!!!!! https://t.co/NBWJYYnMdl", "@sweepingexits Be the panda! Save yourself!", "RT @SInow: The look on this 7-year-old's face is priceless. \n\nHe just received a custom Gritty prosthetic leg, and then this happened... ❤️…", "@JoshL1220 DONT TEASE ME", "@johndietzdh Only 2 home games the entire season on Saturdays", "@JoshL1220 Maybe one more year to make some bank. You’re young. 😉 You have to do what makes you happy. You had a miserable year last year. Hopefully only good things coming for you!", "@JoshL1220 I don’t even make the starting at most of these districts. 😂 it will be interesting to see what my public charter does with salaries. I go in July 8th for signing day. Are you going to stay or move on?", "@Bethenny Of course they’re portrayed as innocent because they were and are!", "My social media team literally crushing it. You have to have the sound up for the penguin crush. https://t.co/OYwPwm2d60", "@refinnejzahzah https://t.co/IRsJJzyz1N", "@StarsInsideEdge I’m so happy for him!", "What the actual hell! https://t.co/JWMng2OlBk", "Soooo... This is my 34th year in education. I have so many things I could say about these numbers. https://t.co/vT2OZCow8o", "I miss this man https://t.co/Ey7iRgN0he", "!!! https://t.co/spSyyJZIsG", "@fourfreedoms_ I did too!", "@LisaVanderpump Blessings to you and your family. 💕", "RT @RetroNewsNow: 🎶Prince released his sixth studio album 'Purple Rain' 35 years ago today, June 25, 1984 https://t.co/LNKA1cdGST", "If I were in her district, I’d vote for her. Incredible story https://t.co/IlAYJro696", "Who did this? #Drake 😂 https://t.co/LIaZNnC8r9", "@runphoebe1 “One of these colonizers” Great comment. But then... “and I ain’t got my nails done”.  I know women who would say that. Lol  the advent of the camera phone continues to show how far away we are. Sighs", "RT @MichaelSctMoore: Somali pirates gave me toothpaste &amp; soap. https://t.co/K8zCP3IVMm", "RT @BryanDisagrees: A social network for knitting just made every other website look like goddamn cowards https://t.co/1R40mFUrxu", "RT @politico: Signs of an economic slowdown are mounting, which is bad timing for President Trump's reelection hopes https://t.co/670MKW4oW4", "Oh gee... I have a comment but I’m going to be good. #trashfirefanbase #dontjudgeotherplayerswhenoneofyourown... https://t.co/IDObuNuKHZ", "RT @NJDevil00: “Tell me Something, My Friend, Have You Ever Danced With the Devil in the Pale Moonlight?” #Batman89 https://t.co/bCyfnlaIxz…", "RT @kylegriffin1: Trump considered Jeanine Pirro for a top DOJ job under Jeff Sessions — a job she lobbied hard to get, WaPo reports. But S…", "@Traylantha They’re supposedly still in Texas. Back to that tent city close to El Paso.", "RT @TexasTribune: 1/ People are buying diapers, wipes, soaps and toys to donate to children in overcrowded migrant detention centers. \n\nBut…", "Let it go, Susan, let it go.", "@seanshapiro Dang!", "@Beto you need to come home and help us https://t.co/v4hly91dAv", "RT @adri_mdc: Lizzo’s “BOYS” as *Good Boys* a thread:", "RT @seanshapiro: https://t.co/1nEKORnV7u", "@RHartzy18 So did you hear you just got traded? 😂", "RT @MDeFranks: Let’s go. https://t.co/GeDS0SeOrP", "@luxmachina That’s a satisfying montage! 😂😂😂", "Did the Stars buy stock in hair care products? @DallasStars Between Ryan and Tyler and Jamie...", "RT @ckswarriorqueen: @FLOTUS https://t.co/DvS2CjRokK", "@seanshapiro So over/under at the number of stupid penalties", "Soooo... does this mean Ryan isn’t going to take stupid penalties anymore. Good grief. At least he’s pretty.  😎", "@luxmachina Meh... at least he’s hot. 😉", "@panarintoews You’re going to end up stroking out. #YouNeedToCalmDown  😉", "WHERE ARE THE CHILDREN? https://t.co/l956hvX7Ri", "@runphoebe1 Come get me mama!", "But to where? https://t.co/sZ7Qsg0vsF", "@usahockey 🙄", "RT @emrazz: I’ve never asked you for a retweet, until now.  https://t.co/oBZrSHvcbi", "RT @Lights4Liberty: STAND UP. FIGHT BACK. \n\n#DontLookAway #EndUSConcentrationCamps #Lights4Liberty https://t.co/PnNELubaAh", "RT @Lights4Liberty: Profound gratitude to the New York Times Editorial Board for recommending that everyone attend a #LightsforLiberty even…", "RT @goldengateblond: I laughed at this and if it makes me a bad person then I guess we'll both just have to learn to live with that. https:…", "I like one of the teams mentioned. 😉 https://t.co/nJj2VBb9EZ", "RT @SaadYousuf126: Nick Robertson (brother of Stars prospect, Jason) was the 53rd pick\n\nThis comes after he was born prematurely on 9/11.\nA…", "@luxmachina I’ll remember that! I just liked the gif. Hahaha!", "@luxmachina Ok, now I see what y’all are talking about. Lol", "@sweepingexits I needed this today!", "@luxmachina Ah! Hopefully things will come to light for you now. (I hate being confused, but I’m old, so a lot of things are confusing to me) 😎", "I deleted my twitter app, so let’s try this again. 🙄", "@luxmachina That’s some pretty good side eye", "RT @joshscampbell: \"It was a fight... it was against my will, 100%.\"\n\nColumnist @EJeanCarroll on being assaulted by Donald Trump. \n\nAlthoug…", "RT @BetteMidler: I was bait years ago for Melania to get into @voguemagazine when I was invited by #Trump to a birthday party for #AndreLeo…", "RT @elizTrovall: The #Houston flea market is usually crowded on Sundays, but workers here tell me that threats of #ICEraids have slowed bus…", "@TheJockette ... ❤️💚💙💜🧡 https://t.co/KaKYvLGjY4", "RT @BET: .@Lizzo slayed \"Truth Hurts\"!! 😍👰🏾 #BETAwards https://t.co/BxtjsgzuWG", "RT @Bakari_Sellers: Oh my @lizzo just twerked while playing the flute. And tore the stage down.\n\nYou read that right. \n\n#BETAwards19", "I hope everyone is having a good day. I’m hardly seeing anything today on the old twitter.", "RT @kylegriffin1: Nearly 100 internal Trump transition vetting documents leaked to Axios identify a host of \"red flags\" about officials who…", "RT @mjhegar: Hi, I’m MJ Hegar. I’m running for Senate against John Cornyn. https://t.co/I4InHLqGqc https://t.co/6tE3exSGbj", "RT @Johnny_Allman: That one aunt at every wedding https://t.co/HNRTpZpTw4", "RT @JenAshleyWright: If women were making up rape allegations for fame and fortune, 1. Some of these women would be rich and famous by now,…", "#Batman1989 is the best Batman.", "RT @BuffyWicks: #Resist https://t.co/OmPhjm4gU0", "@realDonaldTrump I wonder if he knew any of the songs", "@russianmachine Didn’t he wear the same pants to the all star game?", "@philindallas @SportsSturm Lol you think he doesn’t know that. 😂", "@jezziejaay There’s a lot of shows I have never watched that everyone else has. 😉 I always end up loving everything you write.", "@jezziejaay Verisimilitude, karaoke, phone sex... never watched the office. 🙂", "Anyone else having issues with twitter?", "RT @BriannaWu: THREAD: Here is a list of all the 22 women who have credibly accused Trump of rape and sexual misconduct. Please Retweet.…", "That would be a no from me, Satan https://t.co/ySBUwzsFVD", "RT @WatchTheBreaks: RT if you can name all 12 of these men without reading the comments https://t.co/xHVufVUgw2", "This is insane. The US only had 10 less players chosen than Canada? I remember when hardly any US born players were chosen. https://t.co/wckmis0wvL", "@jezziejaay Well... it’s something? 😉", "RT @BComptonNHL: Anders Lee expects to enter #NHL free agency interview period https://t.co/GkEtLxvfqY via @NHLdotcom #Isles", "@expo1310 @tseguinofficial The stuff of legends.", "RT @_SJPeace_: White man intervenes when a racist neighbor tries to stop some black kids from playing outside saying that they were too lou…", "RT @dodo: Watch this dog play dead so he doesn’t have to go inside 😂 https://t.co/aoi1M3kLsS", "RT @JTBrown23: Playing in the NCAA national championship game, my first NHL game, proposing to my wife, playing in Stanley Cup Finals.... n…", "RT @Turkewitz: At airport:\n\nRept: I'm a reporter who travels to Mexico a lot.\nCBP: What's your story on?\nRept: I'm a US citizen.\nCBP: That…", "RT @PaceSagester: From the @NHL’s insta: love the players got to pick their walk-up songs when they got drafted tonight. Strong choice with…", "RT @c_marleau: Hi, Patrick here. I don’t have my own social media, so I wanted to come here and say a few words to @MapleLeafs, their fans…", "RT @AprilDRyan: We Deserve Better: It has been 100+ days since we’ve had a #WhiteHouse press briefing. It’s unacceptable &amp; the #American pe…", "Haha haha so much for the nhl marketing Subban for the Winter Classic!", "RT @WMM_podcast: April Ryan Sends Scathing Farewell Video Message To Sarah Huckabee Sanders: ‘Girl Bye’ https://t.co/jmuUzktCZZ", "RT @nickmaraldo: Carey Price did an awesome thing last night at the NHL awards for that young boy, but it’s even better knowing he did with…", "LOL like the Flyers were going to draft Cole.", "The greatest American goaltender ever? Really?", "Well... there goes the Stars guy 🙄", "Ahahaha... Canucks fans not happy makes me happy.", "@all_thebros I have no idea. It’s fake Mexican. Not as fake as Taco Bell, as they use good ingredients", "RT @DownGoesBrown: Maybe Yzerman still had Tampa’a late-first draft list?", "@runphoebe1 Unfortunately the person they needed will be playing for the Avs next season. Dach won’t be inmthe nhl. But if I’m wrong, please call me out this fall! 😉", "Yup... 🙄🙄🙄 https://t.co/vWUTc9U2WH", "@runphoebe1 4 players better than him. IMO. And then they let the Avs get the best defenseman. Like they need anymore. 🙄", "Ahahahaha 🙄🙄🙄🙄🙄", "Ok. Some of you think you’re funny, so you’re getting muted tonight.", "Number ONE 🇺🇸🇺🇸🇺🇸", "Well, that video with that quote will pissed off a bunch of idiots. 😂😂😂🇺🇸🇺🇸🇺🇸", "I remember when the Sedins were drafted. I be old", "RT @MollyJongFast: The president was accused of rape today and the people on Fox News are arguing about @Madonna", "As a @usahockey fan, I’ve thoroughly enjoyed the lead up to this draft. Let’s go!", "Oh look! It’s Pierre who didn’t think Heiskanen was good enough to put on his Calder ballot. 🖕", "This reminds me of the 4 years when I taught in a two room school house in Minnesota. 85-89.  I think back fondly, and can’t believe I did that. That school has also closed. https://t.co/iFqjQeZAm8", "RT @jonswaine: Here are the Paul Manafort text messages, including sympathetic exhanges with a friend who appears to be Sean Hannity, that…", "@panarintoews Not true.", "RT @jimmyfallon: I’m sorry - but if you missed @WillieNelson on our show the other night - he talked and sang a song for us. I can’t thank…", "RT @cyclonefanatic: THT is going to Hollywood. https://t.co/mr2a5BHLjK", "Omfg... at least I’ll be up with my familymthe next couple of weeks when this farce begins. https://t.co/KkwcxIHVsL", "@GoalieGuy78 All the new rules that are being tweeted tonight.", "NHL games are going to be 5 hours long. This is insanity. Games need to start at 7.", "RT @gtconway3d: he’s coughing for all of us—thank you https://t.co/Dv6MQyLrB8", "Oh no! Good luck to Ryan and his family! https://t.co/pTlTjwBeHU", "RT @glaad: .@Madonna has fought for LGBTQ people her entire career. https://t.co/MbnW6eufYi", "Watching the first season of #RHONYC is interesting 11 years later.", "RT @taj_sohal10: So I saw a proposal today... https://t.co/YRD5QIjYCU", "RT @MikeKellyNHL: If you don’t think Miro Heiskanen was a top-5 rookie in the league this year, at best you didn’t watch the Stars play ver…", "RT @seanshapiro: 19 times 2 is 38 https://t.co/nRk0HTSPTT", "Two CBJ writers, two Pens writers, two THN writers... very disappointed in Sara C with the Canes. And of course, Pierre. 🙄🙄🙄. That’s ok. Show them on the ice Miro. https://t.co/rFeGf7Wh9V", "RT @frank_seravalli: Every voter, every vote, available to the public: ⬇️ https://t.co/QBVJvMyzJU", "RT @KimOlsonTx: In my life I’ve fought many battles. But all of them lead me to this one: running to represent you in Congress TX-24. Be a…", "RT @IncorrectStars: Everyone: Minding their own business\n\nJamie Benn’s knee: 👁", "Gus got more votes than Klingberg??? Good lord! https://t.co/XhmVjEteJB", "RT @jkbjournalist: MIAMI HERALD EXCLUSIVE: Naked photographs of Jerry Falwell's wife surface in Miami Beach scandal. https://t.co/42hEZ1AZQK", "I mean, I knew Bish wouldn’t win because he played less games.", "BS! Bishop was better!", "Not really pleased that they did that to that child. My god, what did they think would happen. At least it worked out. Way to go Price for being amazing.", "GOOD BURGER", "RT @UrbanAchievr: If you think the strongest criticisms of Trump are “his style, his insults, his lack of class,” you’re already wearing th…", "@GarRebekka Lord no. That tony Babcock person.", "Who the hell is this comedian?", "That’s ok. Keep showing that McJesus goal against my team. They didn’t win the game, nor did they make the playoffs. 💅", "@refinnejzahzah Truth!", "Ridiculous that Seth Jones didn’t get more votes. https://t.co/W0rU6x12t3", "Nice suit Auston! 🇺🇸🇺🇸🇺🇸", "An American from the desert. 🇺🇸🇺🇸🇺🇸", "@expo1310 He wore the same pants for All Star Game festivities. This according to some fangirls.", "YAY ZUCKER!!", "Thank goodness Armstrong didn’t win", "How any of these yahoos left Heiskanen off their ballot is just a mystery. Guess he didn’t play out east or for a Canadian city.", "@NHLNetwork I hope you’re going to post Patrick Kane’s interview since you’ve posted the others. Thanks!", "RT @AndrewLSeidel: Imagine being so full of righteous Christian hatred that even Cracker Barrell tells you to get the fuck out.\nhttps://t.c…", "RT @TeenChoiceFOX: RT to give #TeenChoice LOVE to @TheHateUGive now for the 2019 #ChoiceDramaMovie! ❤️ https://t.co/A9FHTUWjGd", "@fourfreedoms_ Why yes it does!", "I LOVE HIM!! Blue is his color. 💙💙💙💙", "RT @SonyaChildress: This is my grandmother. Born in Goodwill, Texas 106 years ago. She is very much alive. Her grandfather was born enslave…", "@midnightbex My face is one of revulsion.", "@Lacyerion I mean, I’m not an ink person, but that? Creepy", "Why is my captain putting this on his body?? https://t.co/wcUPI437Pb", "I hope he retires just to f up the Canucks. 🙂 https://t.co/3x5YwbMdK7", "RT @fifththirdarena: Opening night of the @chiprohockey league is just a few weeks away! RT this post &amp; follow us to win this signed @Kenda…", "@JoshL1220 That wouldn’t be difficult", "RT @MDeFranks: Tonight's order of NHL awards:\nCalder\nArt Ross\nLady Byng\nGM of the Year\nKing Clancy\nTed Lindsay\nNorris\nNHL 20 Cover\nMasterto…", "GOAT https://t.co/uCt5lnApjD", "All about his mom. This is excellent! https://t.co/oa8V4qRvfk", "This is awesome. Good on him. https://t.co/hK3N1NpnS9", "Well... https://t.co/T5D1fGZRNe", "Congratulations @Benbishop30! Winner of Best Halloween Costume #NHLFanChoice  https://t.co/rd2OsfspM1", "Congratulations @DallasStars and @tseguinofficial @jamiebenn14! Winner of Top Team Video #NHLFanChoice  https://t.co/rd2OsfspM1", "Congratulations @tseguinofficial @jamiebenn14! Winners of Best Bromance #NHLFanChoice  https://t.co/rd2OsfspM1", "RT @CoryBooker: No, you won't. https://t.co/x8E7Mlriue", "@CoffeeKristin interesting where he ended up. https://t.co/xzNaWDZ3pw", "RT @DennysDiner: find cute baby from viral video and bring him to Denny’s … ✅ https://t.co/f6BvdfnzaB", "RT @glaad: A beautiful tribute to Hector Xtravaganza at the end of tonight's episode of #PoseFX https://t.co/RydmDv2hwi", "I liked Sean Duffy better when he was on The Real World and his biggest claim to fame was throwing axes and such.", "@marcorubio You have sold your soul to the soulless. So much for WWJD", "RT @PoseOnFX: Introducing Elektra Wintour and the #HouseOfWintour! \n\n#WintourIsComing nay Wintour has arrived! #PoseFX", "@PattiLuPone on @PoseOnFX is giving me LIFE! #PoseonFX", "So much for signing Zucc. That’s insane play money https://t.co/1RQrGDXQdY", "RT @PhilipinDC: Proud Boys and white power signs in Orlando. https://t.co/t0ELnjtkTB", "So is ours... so is ours... https://t.co/QrEIDVJu0b", "No. It’s the fact that trump’s supporters don’t want to actually say they support him. Although, they aren’t as hidden as 2016. https://t.co/rWjFVpLhVS", "RT @atrupar: Holy shit -- years after DNA evidence exonerated them, Trump suggests the Central Park 5 are guilty and refuses to apologize f…", "@runphoebe1 I have one, thanks! I’ll check it out when I get home.", "@runphoebe1 Is this on the Athletic? Thanks.", "I don’t want to go outside.", "Well... https://t.co/juTzuqymLu", "This isn’t optimal https://t.co/4S1CS6KuHV", "@NHLBlackhawks So is he going to go to the skating guru that changed Brian Boyle’s skating around? Because that’s needed.", "RT @colbertlateshow: On #LSSC tonight: Mitch McConnell says Jon Stewart is ‘bent out of shape’ for asking Congress to extend the 9/11 Victi…"]